{
  "Medium": [
    {
      "category": "Development",
      "id": 10000,
      "url": "https://blog.po.et/in-the-crypto-ecosystem-its-still-1968-but-we-re-moving-fast-8995770a2863",
      "title": "In the Crypto Ecosystem, it’s Still 1968 — but We’re Moving Fast",
      "text": "Po.et is building the platform for the world’s creative assets: the internet of content value. It’s not just another walled-garden content-license marketplace, but the protocol foundations that all future content software can build on. Think of it like the TCP/IP of content value: the core foundation of tomorrow’s internet. Everything online revolves around content, and our primary mission is to unlock the value of that content.Our work isn’t just about journalism, or writing, or movies, or music or video. It’s about people, communication, accessibility and opportunity for everyone.\nThis kind of work doesn’t happen overnight, and it’s the kind of work that will eventually require a high degree of collaboration, consensus and adoption. We’re drafting the initial blueprints now, but that work is open source and we’ll collaborate with a large number of people and companies to build a foundation that we as a society can all build on top of and benefit from.\n        Our CEO, Jarrod Dicker, is meeting with influencers in the publishing and content industry, including publishers, media producers and distributors, to listen to their pain points and learn how we can help.\n        We’re seeing a clear view of the problems those industries need to solve, and we’re setting the highest-value priorities to focus on in the near-term. This has been an enormous discovery process for us, and I’m pleased to report that the publishing industry shares a lot of our concerns with the status quo and is very hungry for change that will benefit everybody: content producers, publishers and consumers alike.\n        State of the DApps\n       As Po.et prepares for its mainnet launch, it helps to put the state of the crypto tech ecosystem in perspective.\n       CryptoKitties Craze Slows Down Transactions on Ethereum — BBC News\n      The Inside Story of the CryptoKitties Congestion Crisis — ConsenSys\n      Ethereum Price Achieves New All Time High: The CryptoKitties Effect — CNN\n       Find out what happens when one [DApp] gets so big it threatens to bring down a whole blockchain. — ConsenSys\n     The headlines above make it sound like CryptoKitties is the biggest craze since Pokémon Go, which attracted 500 million downloads in 2016 and about 25 million daily active users at its peak.\n The reality is much different. According to DAppBoard, CryptoKitties peaked at only 17 thousand daily users during the big spike in December 2017, and immediately fell into decline. Today, CryptoKitties has only ~650 daily active users, and falling.\n CryptoKitties total users (green), daily active users (orange), and new users (blue), not scaled (actual numbers)\n To illustrate the difference, I wanted to create a bar chart to compare CryptoKitties and Pokémon Go. That didn’t work out very well: \n Top: CryptoKittes (not visible), Bottom: Pokemon Go It gets worse. According to DappRadar: \n CryptoKitties is currently #3 in Ethereum’s top 10 most active apps by number of transactions & daily active users (DAU) There are fewer than 20 Ethereum dApps with more than 100 daily active users Ethereum is by far the most popular dApp platform by market cap, dominating it’s closest competition (EOS) 6:1.\n Data Source: CoinMarketCap\n The first thing every developer needs to learn about blockchain technology is that you can’t do everything on a blockchain. In fact, you can’t do much of anything on a blockchain. If the next part starts to scare you, skip to this section: We’re Early and That’s OK.  We’re Computing on the Equivalent of 1960’s Hardware.\n Developers take virtually free storage and computation for granted, but blockchains don’t work that way. Typical modern applications contain millions of lines of code. Typical smart contracts contain only dozens of lines of code.  Right now, the cost of committing transactions permanently to the Ethereum blockchain is astronomical. As I write this, the entire Ethereum blockchain size is only about 1 terabyte. (Note: that’s for its full history. Etherscan is only tracking FAST sync now.) That storage capacity is shared by every user of all Ethereum DApps combined.\n Thirty-two bytes of immutable Ethereum blockchain storage costs 20,000 gas. One gigabyte costs 20,000 * (1,073,741,824 (bytes per gigabyte)/32) = 671,088,640,000 gas. Today’s ETH cost for that gas is 6710.8864, close to $4.7 million."
    },
    {
      "category": "Development",
      "id": 10001,
      "url": "https://medium.com/@ageitgey/understand-the-gdpr-in-10-minutes-407f4b54111f",
      "title": "Understand the GDPR in 10 minutes",
      "text": "Like a school kid who hasn’t started their year-end project by May, are you kept awake at night with a creeping fear that you are supposed to be doing something about the GDPR but you feel like you’ve waited way too long to ask what exactly it is?\n Let’s fix that! Here’s a basic idea of what the GDPR means to your small internet business — in as few words as possible!  \n Note: I’m not a lawyer. I’m not even an EU resident. I’m just sharing my own notes to save you time and point you in the right direction. I make no claims that this information is accurate and no one should ever listen to anything I say.  What is the GDPR?\n Unlike the United States government, the European Union is tired of giant internet companies collecting tons of consumer data and then constantly leaking it or misusing it. To attempt to fix this, they created the General Data Protection Regulation (GDPR). It’s a set of new European Union regulations which sets out exactly how companies must manage personal data.  If your company doesn’t comply, you can be fined as much as tens of millions of Euros (in proportion to the severity and scale of your violation).\n European Union? But I’m in the UK. LOL Brexit!  Sorry, GDPR regulations still apply before Brexit completes and the UK has said they will implement their own GDPR equivalent after Brexit. So nothing is different for you.\n European Union? I’ve never even been there!  TWIST — you are still probably affected. You have to follow GDPR regulations for managing personal data if you offer goods or services to anyone in the EU regardless of your location!\n Guess what? Your website or mobile app is a service and IP addresses are considered personal data. So unless you just block anyone in the EU from using your service or you don’t collect any personal information at all, you still need to comply.  \n But I heard that the GDPR only applies to businesses with over 250 employees!  No, that’s not correct at all. There are some relaxed documentation rules for small companies that only occasionally process personal data, but in general you still have to follow GDPR regulations.  \n When does the GDPR take effect?  You can start getting fined for not following the rules as of May 25th, 2018.  \n Ok, fine! What kind of personal data is regulated?  GDPR covers any data that can be used to identify a person, even indirectly. So the following kinds of personal data are regulated: \n Obvious stuff, like names, addresses, GPS location and bank details.  Less obvious stuff, like IP addresses, Email addresses, or even a user’s posts, tweets or instagram stories.  Even less obvious stuff, like raw user ids or “anonymized” data if it is possible to work backwards from the data to identify the person.\n What do I need to do to comply with the GDPR?  While the full GDPR regulations are quite long and complex, we can mentally break them down into a few broad requirements that are easier to think about.  \n Requirement 1: Justify your need for personal data First, you can only collect personal data if you have a valid reason for collecting it. But you can’t just make up your own reason. The EU says that there are six legal justifications for collecting data: \n You got explicit consent from the user to collect the data.  You need the data to fulfill contractual objections with the user — like how a phone company obviously needs to know a customer’s phone number to provide phone service to that subscriber.  You need the data to comply with another law.\n You need the data to protect someone’s life.  You are a public authority (like a government office) and you need the data to carry out your responsibilities.  You have a “legitimate interest” in the data. This justification is vague and requires extra documentation.\n In general, you are expected to use the most limited justification possible and have an actual business need for all the data you are collecting.  Furthermore, you need to pick your legal justification for collecting the data before you collect it and you need to tell the user your justification at the time you collect the data. For example, you can’t tell a user that you need their address to ship them a product and then turn around and resell that address to an advertiser.\n Each these legal justifications has it’s own set of sub-rules that you have to follow. For example, getting consent from a user to collect their data must be done according to a set of very specific rules. Gone are the days of pre-checked checkboxes and legal disclaimers hidden in privacy policies.  \n Things get much messier if you are working with certain kinds of data that are considered extra sensitive — things like race, religion, sexual orientation, political party or trade union affiliation, health information and biometrics. If you work with this kind of data, you should probably stop reading this and just go talk to a professional.  Requirement 2: Give Users Control Over Their Data\n Once you collect data, you are required to give users control over the data that you collected. The GDPR outlines eight specific rights that users have over their data: You have to tell your users why you are collecting their data, what you are doing with it and how long you are keeping it.\n If a user requests it, you have to give them a copy of the all data you have collected about them.  If a user says that their data is inaccurate, you have to correct it.  If a user requests it, you have to delete all their data.\n If a user requests it, you have to stop processing their data.  If the user wants to move from your service to another service, you have to allow them to transfer their data out of your service in a machine-readable format.  A user has a special right to object to their data being used for certain purposes, like direct marketing.\n If you are using personal data for automated decision making or profiling (like feeding customer data into a machine learning model to approve a home loan), then you are exposed to a bunch of extra requirements around explaining how your model works, having an appeal system and so on.  In most cases, you are required to process any of these user requests within one month.  \n Depending on your justification for originally collecting the data, not all of these user rights always apply. There is a byzantine matrix of which rights apply for which legal justifications. But if you generally structure your operations so that you can support all these user rights, you should be fine.  Requirement 3: Keep Customer Data Secure\n Under the GDPR, you are required to keep personal data secure and you are required to regularly test your security measures. You are also expected to consider security as part of your design process and not just bolt-on some weak security measures after you build your product.  What does that mean exactly? The GDPR only gives you guidelines like taking “appropriate technical and organizational measures.” It doesn’t tell you exactly what you need to do, but this checklist is probably a pretty good place to start.\n Along these lines, you also need to proactively monitor for data breaches, report any breaches within 72 hours to regulators and keep records of any breaches.  \n Requirement 4: Implement Data Governance and Documentation A big part of the GDPR is maintaining proper governance, accountability and record keeping. For everything we’ve mentioned so far, you have to be able to document your compliance.  \n Here are some of the specific requirements: You must have written records of your purposes for collecting data, your data retention policies, a history of any time data is shared, your security policies and so on.\n If you hire anyone external to process your data for you, you must have a written contract with them outlining their privacy responsibilities.  If you are a small or medium-sized business (less than 250 employees) that only does “occasional” data processing of EU residents, some of these requirements are relaxed and you aren’t expected to keep written records (with some exceptions around “risky” data).  \n Things do get much more complicated if you are a large company (over 250 employees) or work with “risky” data. If either of those apply to you, go talk to a professional. You have to do extra things like carry out regular protection audits (DPAs) and name a Data Protection Officer (DPO).  That sounds impossible! I give up!\n If you are a small business located in another country like the United States, you might be tempted to block all EU users instead of risking exposure 20 million Euro fines.  But that kind of reaction is probably a misunderstanding of how EU regulators work. The goal of these regulations are to improve data handling, not to introduce impossibly complex rules and then penalize a company on a technicality. The GDPR clearly spells out that companies that do their best to cooperate with regulators and follow these regulations will be much less at risk of fines.\n Ok, I get the basic idea. I need to start being responsible and transparent with user data. But where can I learn more about the regulations?  To learn to apply each of these requirements in more detail, check out the GDPR guide from the UK’s Independent Commissioner’s Office. It covers each of these same topics in much more detail, offers suggested compliance checklists and links to the full regulations where needed.\n Good luck!  \n Thanks for reading! If you are interested in Machine Learning (or just want to understand what it is), check out my Machine Learning is Fun! series or sign up for my newsletter.  In the spirit of the GDPR, this is my official notice that I am collecting your email address with your explicit consent in order to email you when I write new stuff or have relevant news to share. I won’t give your email address to anyone else. Whew… That wasn’t too hard!"
    },
    {
      "category": "Development",
      "id": 10002,
      "url": "https://medium.com/@ageitgey/the-real-scandal-of-ai-awful-stock-photos-456633b9b0fc",
      "title": "The Real Scandal of AI: Awful Stock Photos",
      "text": "There’s been a lot of talk recently about whether or not AI research is in a bubble. Some people are worried that we’re approaching another AI winter — a period where AI research funding dries up if AI can’t deliver on the hype.\n Sure, there is a lot hype and bad reporting around AI. Just look at all the news reports calling Sophia the “first AI citizen” when it’s really just a weird puppet head hooked up to a chat bot: \n Spoiler: No, it can’t.  But even if the recent advancements in Deep Learning aren’t really intelligence per se and don’t get us closer to Strong AI, deep learning has definitely made an impact. It’s led to huge advancements in real products the help real people every day, like Google Translate:\n So let’s not argue about whether or not we are in an AI bubble. Instead, let’s focus on an even more important issue that we can all get behind — the absolutely atrocious stock photos used in almost every single news story about AI.\n Here’s what I’m talking about: \n Is an exploding head a good thing or a bad thing? Not 100% sure.  It seems like every article on AI has a picture like this — just a glowing head overflowing with the power of computers.\n I guess part of the problem is that stories without pictures are boring and it’s really hard to illustrate the idea of AI. So they have to throw in something.  \n But there has to be a better illustration than a robot finger poking at a keyboard: \n The entire history of humanity has resulted in this — a robot that can press the space bar Another popular approach is to dig up a generic 3D model of an android from 1998 and paste it over a circuit board: \n Did you know that his robot can think? In case it wasn’t clear, we tossed in a picture of a brain and the words “artificial intelligence”.  To be fair, I bet this kind of design work isn’t much fun for the graphics team either. I imagine designers staring blankly at their computers for for hours trying to think of the 400th way to illustrate “AI”.\n But you can tell a designer is really phoning it in when they literally paste a bootleg Adobe Illustrator icon on top of a picture of an iPad, add a glowing ET finger and call it a day: \n Forbes.com, a professional news organization, posted this graphic.  The AI stock photo disease has reached epidemic status. Just do a search for “AI” on Google News and you’ll see what I mean:\n I love shaking hands with robots. They are all so intelligent these days!\n But like any epidemic, there must be a patient zero, right? My best guess is noted ML pioneer Andrew Ng. He’s done a lot in his career. Not only did he found Google Brain, but he’s done more than probably anyone else to educate programmers on how machine learning works. By all accounts, he’s a really great guy.  But he’s also responsible for popularizing Machine Learning with this graphic:\n And as a result, we now we live in a world where googling the word “AI” looks like this:\n I think it’s time we all take a stand. It’s time we stop letting the media get away with this. No more glowing circuit boards. No more robots shaking hands. No more nonsense circuit boards with “AI” written on top of them.\n Or can we — at the very least — start using photos of the best android in existence?  \n So if you are one of those poor, unfortunate graphic designers stuck illustrating AI, go ahead and take the rest of the day off — here’s a free one on me: \n If you inexplicably want to more read stuff that I wrote, check out Machine Learning is Fun!  \n If you want to be notified when I write something new about ML, you can sign up for my very low volume email list:"
    },
    {
      "category": "Development",
      "id": 10003,
      "url": "https://medium.com/javascript-scene/must-see-javascript-dev-tools-that-put-other-dev-tools-to-shame-aca6d3e3d925",
      "title": "Must See JavaScript Dev Tools That Put Other Dev Tools to Shame",
      "text": "When I got into JavaScript, there was only one browser that mattered: NetScape. It dominated completely until Microsoft started shipping IE with the OS. In those days, the argument that JavaScript’s developer tools were weak was actually true.\n But it hasn’t been true for a really long time, and today, JavaScript has the best dev tool ecosystem I’ve ever seen for any language.  \n Note that I didn’t say “the best IDE”. If you’re looking for a central IDE that unifies your entire dev tool experience, check out Microsoft’s Visual Studio for C#. Pair it with Unity for a good time. I don’t use it myself, but I have heard from people I trust that it’s pretty solid.  I have used C++ and the Unreal Game Engine. The first time I tried that, I realized that the web platform dev tools still had a long way to go.\n But we’ve come a long way since then, and the tools we use now in JS make fancy IDE autocomplete look like a baby chew toy. In particular, JavaScript’s runtime tooling has no match that I’m aware of in any other language.  \n “JavaScript has the best dev tool ecosystem I’ve ever seen for any language.” What Are Dev Tools?  Developer tools are a collection of software that makes life easier for developers. Traditionally, we’ve thought of them primarily as the IDE, linter, compiler, debugger, and profiler.\n But JavaScript is a dynamic language, and along with its dynamic nature comes a need for more runtime developer tooling. JavaScript has this in spades.  \n For the purposes of this article, I’m going to include runtime tooling, and even a couple libraries that enhance runtime developer visibility and debugging. The line between dev tools and libraries is starting to blur. With mind-blowing results.  TL;DR quick list:\n Atom & atom-ternjs Chrome Dev Tools PageSpeed Insights\n Firefox Developer Edition Browsersync TraceGL\n node inspect debugger ESLint rtype (the spec) & rfx (the library) Warning: These are unfinished developer previews.\n Babel Greenkeeper.io & updtr React\n Webpack + Hot module replacement Redux + Redux DevTools About the Tools\n Your dev life is going to center around two things: The editor, and your runtime environment (e.g., the browsers, platforms, and devices you’re coding for).  The Editor: I started my dev career using big, massively integrated IDEs like Borland IDE, Microsoft Visual Studio, Eclipse, and WebStorm. In my opinion, the best of these are WebStorm and Visual Studio.\n But I got tired of the bloat that comes with many of those IDEs, so for the last several years, I’ve done most of my coding in more stripped-down editors. Primarily Sublime Text, but I recently switched to Atom. You’ll also want atom-ternjs to enable JavaScript intellisense features. Read “Supercharge JavaScript Development in Atom” for lots of great Atom plugins.  \n You may also want to look at Visual Studio Code. A slimmer Visual Studio for people who like minimal pluggable editors like Sublime Text and Atom.  I also use vim for quickie edits from the terminal.\n Debuggers: I missed the integrated debugger when I started programming for the web, but the Chrome and FireFox teams have elevated runtime debugging to a whole new level. Everybody today seems to know about Chrome’s DevTools and how to step through code, but did you know it has great features for advanced performance & memory profiling and auditing? Have you used the flame charts or the dominators view?  \n Speaking of performance auditing, you also need to get to know PageSpeed Insights: \n On top of all that goodness, there are also some cool features for live editing CSS, & very cool features to help you edit animations. Get to know your Chrome DevTools. You won’t regret it.  \n Not to be outdone, FireFox has a dedicated browser just for developers. FireFox Developer Edition: \n Browsersync: Browsersync is a great way to test your responsive layouts by controlling several browsers at once. In other words, you can use the Browsersync CLI to open your app on your desktop, tablet, and phone.  You can tell it to watch files and automatically reload the synchronized browsers on file changes. Actions such as scrolling, clicks, and form interactions will also be synchronized across devices so you can easily test your app workflows and be sure that everything appears correctly everywhere.\n TraceGL: TraceGL is a runtime debugging tool that lets you observe all of the function calls in your software as they’re happening in realtime, rather than stepping through your code manually, one step at a time. It’s super powerful and extremely useful.\n node inspect debugger: The latest Node v6.x.x stable versions have a built-in Chrome-enabled node-inspect style debugger. With it you can connect to your running Node process and step through your code with Chrome’s DevTools.\n To use it with Babel, I use the following `debug.js` script: \n require('babel-core/register'); require('./index'); To launch the debugger:\n node --inspect source/debug.js Works like a charm.\n Linting: ESLint is by far the best linter I’ve used for any language. I like it better than JSHint, and much better than JSLint. If you’re not sure what to use, stop worrying and use ESLint. Why is it so cool?  \n Very configurable — every option can be enabled and disabled. They can even take parameters.  Create your own rules. Do you have your own style conventions you want to enforce on your teams? There’s probably a rule for that, but if there isn’t, you can write your own.  Supports plugins — Using some special syntax? ES6+ or experimental features for future versions of JavaScript? No problem. React’s JSX syntax for compact UI components? No problem. Your own experimental JavaScript syntax extensions? No problem.\n Type support: JavaScript has loose types, which means that you don’t have to annotate all your types. After annotating everything for years in languages like C++ and Java, I immediately felt a cognitive load weight lifted off my shoulders when I started using JavaScript. Type annotation creates noise in your source files. Functions are often easier to understand without them.  Contrary to common belief, JavaScript does have types, but instead of typing variables, JavaScript types values. Variable types can be identified and predicted using type inference (that’s what that Atom TernJS plugin is for).\n That said, type annotation and signature declarations do serve a purpose: They make great documentation for developers. They can also enable some important perf optimizations for JavaScript engine and compiler creators. As a JavaScript programmer building apps, you shouldn’t worry about the perf gains. Leave that to the engine and spec teams.  \n But the thing I like best about type annotations is runtime type reflection, and the runtime developer tools that can be enabled using it. For an idea of what those tools could be like, read “The Future of Programming: WebAssembly and Life After JavaScript”.  For years, I used JSDoc for annotation, documentation, and type inferrence. But I got sick of its awkward limitations. It feels like it was written for a different language and squeezed into JavaScript later (which is true).\n I was also really impressed by TypeScript’s structural type solution.  \n TypeScript has issues though: It’s not standard JavaScript — opting into TypeScript means opting into the TypeScript compiler and tool ecosystem — often opting out of solutions made to work with the JavaScript standard.\n It’s heavily class-based. An awkward fit for JavaScript’s prototypes and object composition.  It doesn’t provide a runtime solution… yet — they’re working on it using experimental features of the new JavaScript Reflect API, but then you’re depending on very experimental spec features that may or may not land in the spec.  For those reasons, I started the (currently unfinished) rtype and rfx projects. rtype is a specification for function and interface signatures designed to be self documenting for readers who already know JavaScript. rfx is a library built to wrap your live JS functions and objects in order to add type metadata. It optionally adds automated runtime type checking, as well. I’m actively collaborating with people to improve both rtype and rfx. Your contributions are welcome.\n Keep in mind that they’re very young, and there will almost certainly be breaking changes in the short-term.  \n Babel: Babel is a compiler that lets you use not-yet-supported features of ES6+, JSX and more in your JavaScript code today. It works by transpiling your code into equivalent ES5. Once you start using it, I predict you’ll get addicted to the new syntax quickly, because ES6 offers some truly valuable syntax additions to the language, such as destructuring assignment, default parameter values, rest parameters and spread, concise object literals, and so on… Check out “How to Use ES6 for Universal JavaScript Apps” for details.  Greenkeeper.io: Greenkeeper monitors your project dependencies and automatically opens a pull request on your project. Make sure you’ve hooked up a CI solution to automatically test pull requests. If the tests pass, just click “merge”, and you’re done. If they fail, you can dig in manually and figure out what needs fixing, or just close the PR.\n If you prefer a hands-on approach, check out updtr. I recommend that you run updtr on your repo before you enable Greenkeeper for the first time.  \n Webpack: Webpack bundles modules and dependencies into static assets for browsers. It enables a lot of really interesting features such as hot module replacement, which lets your live code in the browser update automatically as you change files without a page reload. Hot module replacement is the first step towards a truly continuous realtime developer feedback loop. If you’re not using it, you should be. To get started fast, check out the webpack config in the Universal React Boilerplate project.  React: This one is a bit of a stretch, because React isn’t strictly a developer tool. It has more in common with a UI library. Think of React as the modern jQuery: A simple way to address the DOM. But React is more than that. It is really a UI abstraction layer that abstracts you away from the DOM. In fact, you can target a lot more than the DOM with React, including native mobile UI APIs (iOS & Android), WebGL, canvas, and so on. Netflix uses it to target their own Gibbon rendering API for TV devices.\n So why am I listing it among developer tools? Because React’s abstraction layer is used by some great developer tools to enable the amazing developer tools of the future, featuring hot loading (updates to your live running code without page refreshes), time travel, and more… read on!  \n Redux + Redux DevTools: Redux is an application state management library inspired by the React/Flux architecture and the concept of pure functions from functional programming. Another library in a list of developer tools? Yep. Here’s why: \n Redux and Redux DevTools enable some truly next-level debugging interactions against your live running code. It allows you to get really great, understandable insights about the actions that have been performed in your app: \n It even allows you to shuttle back and forth in time using the time travel debugging features. Here’s what it looks like with the slider view: \n Conclusion JavaScript has the richest array of developer tools I’ve ever seen for any language. As you can see, it’s more of a patchwork than a cohesive IDE environment, but we’re in a cambrian explosion period of JavaScript development. In the future, we may see more cohesive integrated developer tool offerings. In the meantime, we’re getting a peek at the future of programming.  \n I predict we’ll see more live programming features come online as the JavaScript moves deeper into unified application state and immutability (which are the features that enable time travel debugging in Redux DevTools).  I also believe that the line between the application we’re building, and the development environments we use to build it will blur over time. For example, the Unreal game engine integrates blueprint editing into the game engine itself, allowing developers and designers to build complex behaviors from inside the running game. I think over time, we’ll start to see those features in web and native mobile applications as well.\n JavaScript’s linting, runtime monitoring and time travel debugging features have no equal that I’m aware of in any language, but there is more we can do to bring us into parity with tools such as the Blueprint system from Unreal Engine 4. I can’t wait to see what’s coming next.  \n Learn JavaScript with Eric Elliott Online courses + regular webcasts\n Software testing The Two Pillars of JavaScript (prototypal OO + functional programming) Universal JavaScript\n Node React Eric Elliott is the author of “Programming JavaScript Applications” (O’Reilly), and “Learn JavaScript Universal App Development with Node, ES6, & React”. He has contributed to software experiences for Adobe Systems, Zumba Fitness, The Wall Street Journal, ESPN, BBC, and top recording artists including Usher, Frank Ocean, Metallica, and many more.\n He spends most of his time in the San Francisco Bay Area with the most beautiful woman in the world."
    },
    {
      "category": "Art",
      "id": 20000,
      "url": "https://medium.com/@noahbradley/how-i-became-an-artist-4390c6b6656c",
      "title": "How I Became an Artist",
      "text": "I am extraordinarily blessed to do what I love for a living. Somehow in the last decade I’ve turned a hobby into a profession and then into a lifestyle. While I don’t claim any profound wisdom nor that my path is the best one, I thought that some aspiring artists out there might be encouraged to see the road that someone else has taken.\n I The Hobbyist\n 2003–2006 I didn’t want to be an artist.\n I wanted to make video games. I was a nerd. I took programming classes at the local community college when I was 14. I made art (and always had), but only as a hobby.  \n Most of my artistic interests at the time were in making pixel art — primarily because I could use it in the games I was making.  \n I also found the ConceptArt.org forums (they have, notably, since taken a nosedive — but that’s a story for internet-drama history). This was in their heyday when a slew of amazing concept artists and illustrators were active on there. I constantly browsed and posted. It was a goldmine of information and sharing. It was where I discovered that there were people out there who got to paint beautiful, amazing things and made a living from it.  I was also taking drawing classes at the community college. Painting classes soon followed.\n \n Some of the homework assignments for my first drawing class in college.\n \n Some pages from my sketchbook at the time.  \n Around this time I was given a Wacom Graphire4 tablet and thus began my entry into making digital art. These were some of those first attempts.  \n \n These are pieces from my first painting class.  \n An early drawing series done for class.  \n One of the pieces I was more happy with. It was 4' wide and was the front porch of my childhood home.  II The Student\n 2006–2011 My birthday in 2005. The following year I would decide to be an artist.\n In 2o06, shortly before my 18th birthday, I had a monumental week. With typical teenage audacity, I decided to figure out what I was going to do for the rest of my life.  Within a week.\n I spent the week writing lists. Pros/cons. Writing about what I wanted in life. Sitting around thinking. Taking walks.  \n And eventually came down to a few distinct choices.  Programmer. I could make games for a living. I wasn’t a prodigy, but I was a fairly adept programmer for my age.\n Graphic designer. I took design classes at the community college as well and had picked it up extremely quickly. I had even freelanced a little.  Carpenter. My dad builds houses for a living, and it was always an option (and, I suppose, sort of still is) for me to take over the company.  Artist.\n Obviously we all know what I picked.  The reason I decided to become an artist has nothing to do with what would make me the most money, or what I was “talented” at, or even what I necessarily always enjoyed the most. It was simply something that, in my gut, I just knew was the right choice. Without anything better to go on, that’s what I relied on.\n From this moment, the fear began. I have spent every day since, with some variance, utterly terrified of failing. Of not being good enough. Not making enough money to support myself. Being a horrible, embarrassing failure.  \n And it was this fear that propelled me to improve.  My first decision was where to go to art school. Incidentally, no one had told me not to go to art school at the time, so I started researching schools. I figured if I was going to do this, I wanted to do it right. So I looked up rankings and after tons and tons of research decided the Rhode Island School of Design was where I wanted to go.\n \n Three of the drawings for my (first) RISD application. The plagiarism was strong with me.  I got in. Barely.\n I was wait-listed. But eventually got the call that I had gotten in. Unfortunately, it included no scholarships at all. The entirety of the approximate $35k tuition would rest on my shoulders (not to mention living expenses). This was a financially tough time for my family, so every dime would come entirely from loans.  \n I wrestled with the choice as long as I possibly could.  And decided not to go. I would, instead, reapply next year after working on my craft and improving my portfolio in hopes of receiving a scholarship.\n The first thing I did was sign up for a class at nearby University of Virginia to take figure drawing. I had never done any figure drawing beforehand and felt that lacking in my application.  \n \n \n Alongside this, I also began taking private lessons with a local portrait painter, Henry Wingate. He was trained classically and taught me many of these methods of slow observational drawing.\n \n Some of the work done in Henry’s studio. These exercises did wonders for training my eye.  A year passed and it was time to reapply to RISD. I did a fresh set of their required drawings and sent in a portfolio of new work.\n \n My second set of drawings for my RISD application. Slightly less plagiarism.  I still remember the day I got the letter from RISD. It was a big envelope.\n I had gotten in with a $20k yearly scholarship.  \n The following months I would scramble to secure the student loans in order to pay the remainder of the costs. My parent’s financial situation, thanks to the housing crisis, was still bleak. So as much as they would have loved to have helped, it was on me (and the good people at JPMorgan Chase).  \n My first dorm room at RISD I made it to RISD. And then I worked. I mean worked. To RISD’s credit, they are wonderous at making their students work hard. My classmates and I put in insane hours working on our craft. If it takes ten thousand hours, then I was getting there as quickly as I could.  \n \n \n As I was transferring with a fair bit of college credit, I had to attend a summer transfer course covering all of the fundamentals. This was some of the work done during that summer.\n \n Work done during my first two semesters of basic illustration courses.  \n I used drawing class homework to do work that interested me. Which was, apparently, giant sad robots.  \n The year came to a close. I had made friends and did more art than I could possibly fit in this post. But the financial realities of staying for another two years were coming to the forefront. Tuition was rising and my scholarship was not. To stay would mean ending up with over $100k in debt.  So I left.\n I transferred to the Virginia Commonwealth University. I had grown up in VA, so I was able to get in-state tuition. The school accepted me even before I applied. It didn’t have the prestige that RISD had, but I would be able to get a degree and continue my study of art.  \n During this summer before I went to VCU, something extraordinary happened. You see, I had spent the entirety of my artistic career avoiding landscape art of any kind. I found it painfully boring. I would even go to a museum and walk straight past all of the Hudson River School painters.  But this summer I actually walked outside with my paints. I did my first plein air work of my life. And I loved it. Every minute of it. The heat, the glare of light, the wind blowing around and bugs flying into my paint. Everything about it just felt… right. I had grown up in the woods of Virginia and it felt like a dream come true to get to create art and experience nature at the same time.\n \n My first plein air work. Acrylics on paper.  So with this fresh outlook on what sort of art I thought I should make, I went to Richmond to attend VCU. I made a new group of friends. And we were all given the assignments of filling up sketchbooks. While I had always had sketchbooks and filled them up from time to time, VCU was obsessed with them. Our professors made sure we were constantly working in them, grading us largely based on the number of pages filled.  \n Now I will take this opportunity to admit that I am not a very good draftsman. And despite filling a sketchbook or two mostly with line drawings, that didn’t improve all that much. So I started painting in them. I knew I could fill a page a lot faster with a brush than a pencil.  Besides drawing my friends, sometimes family, and often strangers, I filled up my sketchbooks with studies of landscapes (from life, the masters, and photos). I knew if I wanted to make good landscapes, I’d need to study them a lot.\n \n \n But still, as any good artist does, I continued to work on my figurative skills. But during this time I noticed an odd sort of trend. People tended to say much nicer things about my landscapes than my figures. Particularly odd considering less than a year prior I had been adamantly opposed to doing landscapes at all.  \n \n \n \n Assignments ranged, as they are, from the useful to the inane.\n \n But this wasn’t enough. I knew that even though I was learning and improving, I needed to work on my own as well. I needed to pursue the things I eventually wanted to be paid to do. So in my evenings, after I was done with classes and homework — VCU, thankfully, had a considerably lighter homework load than RISD — I would do imaginative sketches of landscapes. Ranging from 30 minutes to 2 hours, you might have even called them “speed paintings” back in the day. But they were tools for me to learn how to develop an entire scene, color palette, and mood in a very short amount of time.  \n This was one of the most important exercises I have ever done. This is where I took the years of study and began really applying them.  \n \n \n People responded to them. A lot. But still, I knew that I had to do more if I was going to get paid to do this. Everything I did was unfinished.\n I am an obnoxiously impatient person and I had a hard time working on a piece to completion. I would get sick of something and just want to move on to the next piece. Which is often what I did. So I was sitting on a pile of unfinished work and my junior year was coming to a close.  \n I buckled down and forced myself to finish just one piece.  \n “The Journey Ahead”, my first finished landscape painting.  I had done it. And I was proud. I had produced a piece that, despite all of the flaws I now see in it, is at a fairly professional level. The lighting is good, the composition is solid, the space and atmosphere is believable, and I had forced myself to take enough time that most things are decently rendered.  \n So during the remainder of my semester and into the summer, I worked on finishing my first portfolio of work.  \n \n My first portfolio. The last piece was, interestingly enough, the first piece to be published in Spectrum.\n This is the point everything tipped.  I had spent all of these years working to acquire a base of skills in art and at this point, I had done just that. I was far from being perfect, but I knew I had attained a professional level. And all before my senior year in school.\n It felt amazing.  \n III The Professional 2010–2015\n At Illuxcon — the show that originally shaped my career.  During September of my senior year I took a day or two off of classes to drive up to middle-of-nowhere Pennsylvania for Illuxcon, a fairly new convention for fantasy & science fiction illustrators. I had gone the year before and walked around, talked to a few people, and come away profoundly inspired by the amazing work I had seen there. It had been my goal to come back, get a table at their showcase event, and impress everyone. That was my mission.\n And to some degree, I think I succeeded.  \n I came back with the portfolio you saw above and I did make a splash (giving away hundreds of free prints didn’t hurt). I went from entirely unknown to someone worth noticing. And the art directors noticed too. It was wonderful and exhilarating and I’ll never forget the pure joy of that night, showing off my work.  All of this work led to my first jobs. There’s a little overlapping of timelines here, because the work started rolling in during the summer before my senior year and kept up all through graduation. So I was somewhere between student and professional for about a year there.\n \n One of my first jobs. A couple pieces for Fantasy Flight Games. Paid the miserable rate of $100/piece. But I was the happiest man in the world to have the job.  \n \n \n These 9 pieces represent just a quarter of the original 36 piece commission I received from Legend of the 5 Rings \n Work done for Sacred 3, my first ever real video game I ever got to work on.  \n Work done for a mobile game studio in France.  \n These were great.\n Working professionally felt incredible. But I always have my sights set higher.  \n I wanted Dungeons & Dragons.  I had met with the art director, Jon Schindehette, at Illuxcon and received a very positive review. So I was hoping and waiting for the call. And one night, on the way out to dinner with some friends, I got the email. Jon wanted to give me some work.\n Three commissions, in fact. The biggest one being a cover piece for their online magazine. Wow. Funnily enough, the brief was still titled, “Sam Burley.pdf”, after the name of a fellow illustrator who I suppose was originally intended to do this piece. I did not mind in the slightest being the second tier artist.  \n As Darkness Rises The success with that piece and others led me on to being a consistent artist for D&D for the years to follow.\n And still, during this time, I forced myself to continue producing personal pieces. Just for myself, my portfolio, and my own personal satisfaction.  \n \n Hope of Glory This last piece is very important for me. Hope of Glory is a piece I used as the cover of a postcard mailer I had made up for one of my classes during my senior year (I did, sometimes, still do my homework). Among the many art directors I sent it to was the sole art director of Magic: The Gathering, Jeremy Jarvis, with a quick “Would love to work with you sometime!” scrawled on the back. Magic was and remains one of the most coveted jobs for fantasy artists everywhere. They pay well, have a huge fan base, and only hire very good artists. Plus it’s pretty fun.  \n And a month after graduation I got the email from him.  \n \n I am currently working on Magic card #69 for them. It has been an amazing road working with Wizards. They have been with me for most of my professional career and have served to constantly challenge me and give me room to grow.\n Soon after graduation, I moved back in with my parents. I was doing well enough with freelance work that I could have made it on my own. But I had $40k in student loans that were weighing me down. So I humbled myself and moved back home.  \n I spent the following year working. A lot. Harder than I had ever worked before. Taking on as much work as I possibly could and pushing my skills to be the best. Somehow, some way, by some miracle, I paid off my loans in precisely one year, one month, and one day after graduation. Just past my (insane) goal of paying them off within a year.  \n Some of the most ground-breaking improvements in my art are in these two pieces.  But then I started getting annoyed. I got annoyed with how students are taught and with how art schools take advantage of eager young art students. I saw too many of my peers taken advantage of. They charge tens or hundreds of thousands of dollars and give very little in return.\n So for one thing, I wrote that angry rant that a few of you might have read.  \n Master study, after Thomas Moran. The piece I did for the first week’s demo in Art Camp.  In 2013, I started Art Camp. It was designed to be a summer program that ran for 12 weeks and would teach students the very basic, fundamental exercises they should use to improve their work. They’re all of the exercises I had spent the last several years doing. I had seen so many students utterly confused as to how to improve. So I put together a little program to guide people through the process. And it blew up.\n Like, a lot. I set out to get just 25 students. I ended up with hundreds.  \n I ran another course the following year and now my friend Titus Lunter is running his own art camp on my platform. Where it’ll grow, I’m not really sure. But I hope it continues to help aspiring artists all over the world.  At the heart of my work has always been my personal work. And so in 2013 I finally told everyone that these pieces were part of a cohesive world. One that I call The Sin of Man. It’s a primal, fantastical world full of strange magic, weird creatures, and mysterious gods. I don’t know where this road will lead me, but I love making the work.\n \n \n In the beginning of 2014 I got a couple tweet mentions from a beautiful Australian girl. Within just a few months I had moved to the other side of the world just for the chance to date her. She has encouraged me and inspired me so much in the last year and a half. She’s even a fantastic artist herself. Love ya, babe. ❤ \n \n \n We have had a great time exploring Australia and New Zealand together and she has been a wonderful support as I continue to experiment and refine my craft. And I, on my side, get to see her grow into a professional artist herself.  The following is a sampling of some of the recent personal work I have completed.\n \n \n Which brings us to now.\n I get to travel the world with a beautiful woman, create art for a world of my own design, and help aspiring artists make better work. I can barely begin to express just how lucky I feel to have the life I do. I may have worked at it, but it’s hard to feel deserving of so much.  \n I hope that, in some small way, this post serves to encourage fellow artists on their journey. It can take a long time and seem hopeless. It can be exhausting, discouraging, even depressing. But if you stay at it, someday you will make it past those obstacles.  If I can leave you with one piece of advice that I have acquired over all of these years, it’s to always find some degree of pride in what you have accomplished so far. Be thankful for every accomplishment, no matter how small. Be proud of yourselves. Not to the point of pride, but rather to encourage and motivate.\n Because if you just keep going, eventually you’ll find yourself somewhere."
    },
    {
      "category": "Art",
      "id": 20001,
      "url": "https://medium.com/@sailorhg/art-and-math-and-science-oh-my-f1dc4ebb3223",
      "title": "Art and Math and Science, Oh My!",
      "text": "Growing up, I had two favorite things.  \n I loved art.  \n And I loved science.  \n I was always made to feel that these two interests were unrelated. I had art class at school. I had science class at school. Sometimes I did watercolors on the weekend. Sometimes I taught myself programming on the weekend.  \n And when it came time to decide what to study and what to do with my life, I felt forced to choose between the two. When I was looking into applying to art schools, the art schools I was interested in had no math classes higher than college algebra. Meanwhile, I was set on learning both life drawing and multivariable calculus.  \n I ended up going to engineering school at MIT. I continued to draw in my notebooks while listening to lectures, at night, on the weekends. We live in a culture that values specialization, that values honing in on one thing particularly, and I always felt weird about not spending my weekends on programming side projects, like many of my classmates. I felt weird about liking two very different things equally.  It also made me feel sad to imagine a life with a job where I only used one of the two things that was so important to me.\n As I was trying to piece together all the parts of who I was, a close friend of mine said, “I think that the unifying thing about all of your interests is that you really like creating and making things, whether that’s a painting or a program.” It was at that moment that I stopped feeling weird about loving both engineering and art, & embraced it, and explored how art and technology were connected. And that’s what I’d like to talk about in this post.\n Design makes technology usable.\n If a website or app is poorly designed, it will be hard for people to use, and it won’t matter so much how amazing the underlying technology is.\n If technology aims to improve the lives of people, the usability of its design is just as important as the technology itself.\n Using design and art to teach math and science is one of the topics closest to my heart.\n Linda Liukas, programmer and founder of Rails Girls, a weekend workshop for learning how to code, left her job to write a children’s book about programming, Hello Ruby.\n Her illustrations are colorful and disarming and convey the message that technology is fun and creative and whimsical. This message would be really different if the book had different art — the art totally sets the tone for the learning.  \n Programmer and co-founder of Girl Develop It, Sara Jo Chipps, started a company to make programmable lightup bracelets for teens called Jewelbots. With Jewelbots, anyone who has an interest in jewelry and fashion can build on that interest to learn about programming!  \n I wanted to turn my doodle-filled college notes about algorithms into something that could be useful to other people. I wanted to write zines full of drawings and comics to introduce computer science concepts in a fun, encouraging way. That’s why I started writing Bubblesort Zines.  \n In addition to using comics to explain technical concepts, Bubblesort Zines relates those technical concepts to history and art (for example, introducing binary numbers by talking about the history of numbers around the world).  \n Art can inspire technology.  \n While working at the University of Tokyo’s Human Computer Interaction lab, I saw a coworker cutting open a Rilakkuma bear that he had won in a crane game and panicked a little. But he explained to me I had nothing to worry about: he was cutting open Rilakkuma to put some sensors in the bear. He was turning the bear into a controller for a massage chair. You would massage the bear in the places that you wanted to be massaged by the chair!  \n Most of my coworkers in this lab told me that they got interested in being an engineer because of their love of Doraemon, a robotic cat from a Japanese children’s comic book/tv show. Doraemon was always pulling fantastical gadgets out of his magic pocket. These were things like cameras that took 3D photos of objects and then 3D printed them.  These engineers had grown up with the life dream was to make all of the fantastical gadgets from their childhood come true.\n And when I worked in the humanoid robotics division of Honda Research, most of my coworkers told me that their inspiration for studying robotics was the Japanese cartoon Astroboy, about a little robot boy who fights crime in future Tokyo.\n Why is it significant that people in research labs are inspired to build technology from a fantasy/sci-fi/comic book lens?\n When I ask high school students what they’d like to learn how to make if they knew how to hardware hack or code, they say things like, “Maybe a social app.” “Maybe some kind of a website.” But you get very different answers if you ask them, “What household objects would you enchant if you were in a Hogwart’s charm class?” \n Why? Because suddenly, they’re not thinking about technology in terms of what they’re familiar with or what they’ve heard about. They’re thinking of technology in terms of their most fantastical dreams.  And that’s why stories and movies and comic books are so valuable as inspiration for what technology we build. Technology-inspired technology gives us incremental improvements. Art-inspired technology gives us brand new ideas.\n Technology can bring art to life.\n One very literal example of art bringing technology to life is the experimental theatrical show Sleep No More: an interactive modern retelling of Macbeth where you walk around 4 floors of the set to watch and interact with the actors.\n For future shows, they’re working together with the MIT media lab on making the set itself more interactive with embedded programming: mirrors that write messages to you in blood or typewriters that type out cryptic messages to you if you linger too long in front of them.  \n Another of my favorite examples of technology bringing art to life is Jenn Schiffer’s javascript implementation of Matisse cutouts. She encourages users to not only admire Matisse’s cutouts, but to experiment with creating their own. If you don’t see yourself as artistic, making any kind of art can be intimidating and so your role in art is often just a viewing role. So this is great for people who don’t think of themselves as artistic.  \n You can experiment with it at http://vart.institute/matisse/demo.html!  \n Why should we care about the intersection of art and technology?  The technology/art dichotomy discourages people who might otherwise be interested in one or the other, or forces people who are interested in both to pick one or the other.\n Even if you pick one or the other, understanding both helps you communicate to the people you work with that do the other.  \n Also, incorporating one into the learning of the other makes for rich learning environments.  Imagine an art classes where the science of pigments and color perception is covered.\n Or the class that my best friend teaches: a chemistry class that discusses the chemistry referenced in Sherlock Holmes.  \n Or a poetry classes where you write programs that generate poems.  Art and technology together make the world a better place.\n Amy is a technologist/artist who cares about STEM and STEAM education and making the world better through human-centric design and technology. This post is based on a talk given at ustwo in London."
    },
    {
      "category": "Art",
      "id": 20002,
      "title": "Want Your Children to Survive The Future? Send Them to Art School!",
      "text": "Can you imagine a world in which most jobs are obsolete?  If not, you are most likely in for a rude awakening in the coming decades of radical shifts in employment. This is particularly true for new parents propelling the next generation of workers into an adulthood that many economists and futurists predict to be the first ever “post-work” society.  \n Though the idea of a jobless world may seem radical, the prediction is based on the natural trajectory of ‘creative destruction’ — that classic economic principle by which established industries are decimated when made irrelevant by new technologies.  \n When was the last time you picked up the hot new single from your local sheet music store? Many moons ago sheet music was the music industry, with the only available means of hearing pop songs being to have a musician read and perform them. This quickly eroded with the advent of the phonograph, leading to a record industry that dominated the last century and is now itself eroding due to the explosive growth of independent online publishing.  It’s hard to justify using a massive workforce of recording engineers, media manufacturers, distributors, and talent scouts to accomplish a task that a musician can now do by herself in an afternoon with just a laptop. The same goes for the millions of skilled labor and manufacturing jobs that will soon be crumpled by 3D printing technology, the thousands of retailers whose staff and storefronts can readily be supplanted by automated delivery systems, or the dwindling hospitality and transportation industries currently being pecked away by app-based sharing services like Airbnb and Uber.\n Never heard of 3D printing, ridesharing, or “post-work” theory? That’s okay; you can just Google them. In fact, thanks to Google we may now add the very concept of knowledge itself to our growing list of no-longer-scarce resources. When anyone can access the world’s greatest library from their cellphone, even the long-revered skill of knowing things loses its marketability.  \n The Art School Solution Photo by Jeff White, courtesy of Lowe Mill ARTS & Entertainment\n If preparing your kids for a world in which hard-working, knowledgeable people are unemployable frightens you then I have some good news. There is a solution, and it doesn’t involve tired, useless attempts at suppressing technology. Like most good solutions it requires a trait that is distinctly human.  I’m speaking about Creativity.\n Send your kids to art school. Heavily invest time and resources into their creative literacy. Do these things and they will stand a chance at finding work and or fulfillment in a future where other human abilities become irrelevant.  Any adult reading this at the time of publication came of age in an era when parents urged children to learn a subject that would funnel straight into a specific career field. Even those parents who encouraged their children’s creative dreams did so with an addendum that we should also consider getting a degree in a practical field that “you can always fall back on if sculpture/philosophy/theater/poetry doesn’t work out”. No doubt this protective instinct was a smart one considering the reality of our youth. An arts education might promise a life of self-discovery, but there has always been reasonably assured financial stability in the high-demand arenas of science, education, skilled trades, governments, etc. Surely that dynamic won’t last much longer as more and more physical and mental human tasks are commandeered by machines and software.\n Photo courtesy of Lowe Mill ARTS & Entertainment\n I don’t say this to dismiss the importance of any field of study. A world without scientists or doctors or teachers would be just as broken as a world with no artists. Without programmers and engineers the very technologies that make life efficient would quickly disappear. But with the abundance of information and tools freely accessible online to a generation of youngsters equipped with computers from toddlerhood, it’s safe to assume that those who want to maintain current technology have few obstacles in learning how to do so — No degree required. The same goes for any pragmatic skill.  \n The arts, however, are a polar opposite to pragmatism. Cameras have long exceeded our ability to realistically and efficiently render images, but still our love of painting remains to this day. By now we know that the value of a great painting isn’t in its accuracy at rendering a view but in the artist’s unique capacity to convey a viewpoint. Even those uninterested in “fine” art are driven to make purely aesthetic decisions on practical matters such as clothing, shelter, and transportation. Our willingness to pay extra for beautiful clothes, inviting homes, and sleek cars is motivated not by functionality but by emotionality.  Photo courtesy of Lowe Mill ARTS & Entertainment It’s inherently human to want the objects in our lives to communicate feelings and ideas to us and about us. The constant searching for and assignment of meaning dwells in everyone, but the artist is the person who exercises this muscle regularly enough to control it. The person with creative literacy — a basic understanding of the mental, emotional, and sociological tools used for creative thought and communication — is able to find purpose and apply meaning to her world rather than having meaning handed down and purpose assigned to her. The painting student completes his senior thesis exhibit with a head full of many more lessons than just how to paint. He’s now equipped with an ability to see problems, connections, and solutions where others see only a blank surface. I assure you this ability is not limited to the canvas.\n Photo Courtesy of Lowe Mill ARTS & Entertainment\n I’m not saying anything new here. These qualities of a liberal arts education have been expounded by its proprietors for ages, but with major industries quickly running out of a need for worker bees it’s becoming clearer by the day that our professors were right.  In fact it’s somewhat amazing that this idea was ever in question. Humanity’s highest-paid workers have always been those who as a result of their innovations created opportunity for others to work.\n There’s a reason Steve Jobs became a billionaire, and it’s not because he could program computers.  Of course history is also filled with countless stories of equally creative figures lost in the systemic grind of working for the Steve Jobs’s of the world. We’ve all known brilliant people, seemingly not made for our time, whose potential was crushed by dead end jobs after their work was rejected by the film/music/publishing/anything industries. The excuse of being ahead of one’s time can no longer apply though. We live in an age where a person speaking into a webcam can collectively raise hundreds of thousands of dollars just by telling people about a good idea. The gatekeepers are gone and they are not coming back. Our only remaining obstacle can be lack of good ideas.\n It’s time for a revolution in education that reflects our new reality and gives students the necessary tools to survive it. Technological advancements will always outpace the offerings of the traditional classroom, making it entirely purposeless to force memorization of knowledge that may become irrelevant before children even graduate. Instead we should hone the skill that best ensures adaptability and resourcefulness during times of constant change.  \n It’s time for the creative classroom.  But what about STEM?\n Does this revolution require us to toss out math or science or history? Does my ideal future classroom wedge would-be physicists into an endless curriculum of figure drawing classes?  Absolutely not!\n Let children pursue their own interests and they will find their way to all areas of study as part of the exploratory process. Let the child who is in love with fire trucks continue to obsess over fire trucks. With proper guidance he will soon find himself learning civics, engineering, history, physics, chemistry, sociology, economics, and everything in between — all of his questions fueled by a simple aesthetic attachment to the pretty red fire truck.  \n No healthy child is born without an innate sense of wonder about their world. However, this childhood compulsion to explore is a bud quickly snipped by adults conditioned to fear the unknown. The tradition of discouraging unusual questions and behavior in children is so pervasive that we have come to view those who survive with their creativity intact as having a “gift”. What is more absurd is our amazement at the correlation of great artists and mental illness, as if the battle for self-expression which artists so tenaciously endure has no causal link to their psychic well-being.  \n Photo Courtesy of Lowe Mill ARTS & Entertainment The change that will secure your children’s safe passage through the future comes when we strip creativity of its mysterious, unearthly status. Artists are not magical geniuses. We are simply people who were either privileged enough or stubborn enough to hold onto something that every living person is “gifted” at birth. Assume that your children have limitless creative potential and begin to nurture it. Assume that your children’s ingenuity is the one true safety net available in times of rapid change. Send your kids to art school and they will have exactly what they need to become anything they might need to be.  \n I speak from experience.  \n Photo by Eric Schultz, Huntsville Times Dustin Timbrook is an artist in Huntsville, Alabama who works in many mediums and creative fields. He currently serves as Media Director of America’s largest independent arts facility, Lowe Mill ARTS & Entertainment, and is Creative Director for the marketing company Red Brick Strategies.  \n He is co-founder of Happenin Records, an Alabama record label that helps finance, produce, and promote dozens of independent musical acts.  He is also founder of the Huntsville Artist Engineer Network, and co-founder of STE(A)M Fest, an annual event that promotes creativity in the STEM subjects to thousands of Huntsville students.\n He has a Masters in Education from University of Montevallo, but had to fall back on his painting degree when public education didn’t work out."
    },
    {
      "category": "Art",
      "id": 20003,
      "title": "Don’t go to art school",
      "text": "The traditional approach is failing us. It’s time for a change.  I’ve had it.  \n I will no longer encourage aspiring artists to attend art school. I just won’t do it. Unless you’re given a full ride scholarship (or have parents with money to burn), attending art school is a waste of your money.  I have a diploma from the best public art school in the nation. Prior to that I attended the best private art school in the nation. I’m not some flaky, disgruntled art graduate, either. I have a quite successful career, thankyouverymuch.\n But I am saddened and ashamed at art schools and their blatant exploitation of students. Graduates are woefully ill-prepared for the realities of being professional artists and racked with obscene amounts of debt. By their own estimation, the cost of a four year education at RISD is $245,816. As way of comparison, the cost of a diploma from Harvard Law School is a mere $236,100.  \n This is embarrassing. It’s downright shameful. That any art school should deceive its students into believing that this is a smart decision is cruel and unusual.  Artists are neither doctors nor lawyers. We do not, on average, make huge six-figure salaries. We can make livable salaries, certainly. Even comfortable salaries. But we ain’t usually making a quarter mil a year. Hate to break it to you. An online debt repayment calculator recommended a salary exceeding $400,000 in order to pay off a RISD education within 10 years.\n Don’t do it.  \n Don’t start your career with debilitating debt.  Please. I beg you. Think long and hard whether you’re willing to pay student loan companies $3000 every single month for the next 10 years.\n You’ve got other options.  You don’t have to go to college to be an artist. Not once have I needed my diploma to get a job. Nobody cares. The education is all that matters. The work that you produce should be your sole concern.\n There are excellent atelier schools all over the world that offer superior education for a mere fraction of the price. Here are a few: \n Watt’s Atelier Los Angeles Academy of Figurative Arts The Safehouse Atelier\n There are more. Many, many more. And none of them will cost nearly as much as a traditional four year school.  And then there are the online options. The availability of drawing and painting resources is incredible.\n Sitting at a computer I have direct access to artists all over the world. I have the combined wisdom of the artistic community to pull from at my leisure. For less than a few grand a year I can view more educational material than I would see at any art school. You can get a year of access to all of the Gnomon Workshop’s videos for the cost of a few days at the average art school.  \n With all of these options it can be a little daunting. So you know what? I’ve come up with a plan for you. Do this: The $10k Ultimate Art Education\n $500 - Buy an annual subscription to The Gnomon Workshop and watch every single video they have.  $404.95 - Buy Glenn Vilppu’s Anatomy Lectures and watch all of them.  $190 - Buy all of these books and read them cover to cover.\n $1040 ($20/week x 52 weeks) - Weekly figure drawing sessions. Look up nearby colleges and art groups and find a weekly session to attend.  $2500 - Sign up for a SmART School Mentorship when you feel ready to get one-on-one guidance to push your abilities.  $2400 - Sign up for four classes from CGMA. Get taught by professionals in the industry on exactly the skills you want to learn.\n Free - Watch all of these keynotes.  Free - Study other things for free. Suggested topics: business, history, philosophy, English, literature, marketing, and anything else you might be interested in.  $500 - Throughout the year, use at least this much money to visit museums in your area. And not just art museums. All museums.\n Free - Create accountability. One of the great advantages to attending a school is the comradery. So use the internet to create your own. Go join a forum where you can give and receive critique on the work you’re developing. There are many different ones out there that can suit whatever flavor you prefer.  The rest - Materials. Buy yourself some good art materials to create with. Whether digital or traditional. Don’t skimp.  There. For less than a quarter of the tuition for RISD you’ve got yourself a killer education. You’ve received more quality, focused education than I think you’ll find at any art school.\n Moving forward There has never been a better time to be an artist. I’m inspired by the sheer quantity and quality of internet resources available to artists.\n But I encourage all aspiring artists to think long and hard about their options. Student loans are unforgivable through bankruptcy and can wreck your financial future. Establishing a career while under the unceasing brutality of student loans makes an already difficult task nearly impossible.  \n Find another path. Art is a wonderful, beautiful, fulfilling pursuit. Don’t ruin it with a mountain of debt.  Disclaimer: I do not mean any offense to any of the educators at art schools. I have numerous professors who I consider close friends. This is neither an attack on you, nor your teaching abilities, nor the value that you provide for your students. I’m talking about the schools, not the artists teaching at them."
    },
    {
      "category": "Music",
      "id": 30000,
      "url": "https://medium.com/cuepoint/the-devaluation-of-music-it-s-worse-than-you-think-f4cf5f26a888",
      "title": "The Devaluation of Music: It’s Worse Than You Think",
      "text": "Starving artists have been affected by more than just piracy and streaming royalties\n Intheir many (justified) laments about the trajectory of their profession in the digital age, songwriters and musicians regularly assert that music has been “devalued.” Over the years they’ve pointed at two outstanding culprits. First, it was music piracy and the futility of “competing with free.” More recently the focus has been on the seemingly miniscule payments songs generate when they’re streamed on services such as Spotify or Apple Music.  These are serious issues, and many agree that the industry and lawmakers have a lot of work to do. But at least there is dialogue and progress being made toward new models for rights and royalties in the new music economy.\n Less obvious are a number of other forces and trends that have devalued music in a more pernicious way than the problems of hyper-supply and inter-industry jockeying. And by music I don’t mean the popular song formats that one sees on awards shows and hears on commercial radio. I mean music the sonic art form — imaginative, conceptual composition and improvisation rooted in harmonic and rhythmic ideas. In other words, music as it was defined and regarded four or five decades ago, when art music (incompletely but generally called “classical” and “jazz”) had a seat at the table.  \n When I hear songwriters of radio hits decry their tiny checks from Spotify, I think of today’s jazz prodigies who won’t have a shot at even a fraction of the old guard’s popular success. They can’t even imagine working in a music environment that might lead them to household name status of the Miles Davis or John Coltrane variety. They are struggling against forces at the very nexus of commerce, culture and education that have conspired to make music less meaningful to the public at large. Here are some of the most problematic issues musicians are facing in the industry’s current landscape.  1. The Death of Context\n Digital music ecosystems, starting with Apple’s iTunes, reduced recordings down to a stamp-sized cover image and three data points: Artist, Song Title, Album. As classical music commentators have long argued, these systems do a poor job with composers, conductors, soloists and ensembles. Plus, as I argued at length in a prior essay, they’re devoid of context. While there are capsule biographies of artists and composers in most of the services, historic albums are sold and streamed without the credits or liner notes of the LP and CD era. The constituency of super-fans who read and assimilate this stuff is too small to merit attention from the digital services or labels, but what’s lost is the maven class that infuses the culture with informed enthusiasm. Our information-poor environment of digital is failing to inspire such fandom, and that’s profoundly harmful to our shared idea about the value of music.  \n 2. Commercial Radio It’s an easy target, but one can’t overstate how profoundly radio changed between the explosion of popular music in the mid 20th century and the corporate model of the last 30 years. An ethos of musicality and discovery has been replaced wholesale by a cynical manipulation of demographics and the blandest common denominator. Playlists are much shorter, with a handful of singles repeated incessantly until focus groups say quit. DJs no longer choose music based on their expertise and no longer weave a narrative around the records. As with liner notes, this makes for more passive listening and shrinks the musical diet of most Americans down to a handful of heavily produced, industrial-scale hits.\n 3. The Media \n In the 1960s, when I was born, mainstream print publications took the arts seriously, covering and promoting exceptional contemporary talents across all styles of music. Thus did Thelonious Monk wind up on the cover of TIME magazine, for example. When I began covering music for a chain newspaper around 2000, stories were prioritized by the prior name recognition of the subject. Art/discovery stories were subordinate to celebrity news at a systemic level. Industry metrics (chart position and concert ticket sales) became a staple of music “news.” In the age of measured clicks the always-on focus grouping has institutionalized the echo chamber of pop music, stultifying and discouraging meaningful engagement with art music.  4. Conflation\n A little noticed but corrosive quirk of the digital age is the way our interfaces conflate music with all other media and entertainment choices. iTunes started it by taking software ostensibly for collecting and playing music and morphing it into a platform for TV, film, podcasts, games, apps and so on. This is both a symbol and a cause of the dwindling meaning and import of music in the multi-media onslaught that is our culture. The shiny displays distracting people away from “just” music are already ubiquitous. So why impose them on a music player? I believe that one reason vinyl and phonographs are hot again is that musically oriented people crave something of a shrine for their music — a device that is for music only.  \n 5. Anti-intellectualism Music has for decades been promoted and explained to us almost exclusively as a talisman of emotion. The overwhelming issue is how it makes you feel. Whereas the art music of the West transcended because of its dazzling dance of emotion and intellect. Art music relates to mathematics, architecture, symbolism and philosophy. And as such topics have been belittled in the general press or cable television, our collective ability to relate to music through a humanities lens has atrophied. Those of us who had music explained and demonstrated to us as a game for the brain as well as the heart had it really lucky. Why so many are satisfied to engage with music at only the level of feeling is a vast, impoverishing mystery.\n 6. Movies & Games \n We as a culture do hear quite a lot of “classical” or composed instrumental music, but it has migrated from the concert hall to the video game and movie score. On one hand, that’s given young composers options to make a living, and some very good music is being imagined for these imaginary landscapes. But there’s a pernicious effect of the ubiquitous media sound track, in that whole galaxies of musical ideas and motifs and moods have been essentially occupied and rendered cliché. How does a young person steeped in the faux-Shostakovich rumbling of a war game soundtrack hear real Shostakovich and think it’s any big deal? This is rarely remarked on, but I believe that thousands of cumulative impressions of background music assigned to “romance” and “grief” and “heroism” have laid down layers of scar tissue on our ability to feel something when tonal symphonic music is made or written in the 21st century.  7. Music in Schools\n It all begins — or ends — here. Like any other language, the rules and terms and structure are most readily absorbed by the young. And as music’s been cut from more than half the grade schools in the US in a long, grinding trend, the pushback has been based increasingly on evidence about music education’s ripple effects on overall academic performance — the ‘music makes kids smarter’ argument. This is true and vital, but we tend to lose sight of the case for the value of music in our culture — that music education makes kids more musical. Those who internalize music’s rules and rites early in life will be more likely to attend serious concerts and bring a more astute ear to their pop music choices as adults.  \n Those who care about the future of the music business ought to spend less time complaining about digital disruptions and expend more energy lifting up the public’s awareness of serious music, because we truly do devalue music when we reduce our most impactful art form to an artifact of celebrity and a lifestyle choice. Complex instrumental music has become marginalized to within an inch of its very existence, and that has a lot to do with industry folk defining “value” in only the way that affects their mailbox money."
    },
    {
      "category": "Music",
      "id": 30001,
      "url": "https://medium.com/alex-couch-s-portfolio/how-i-d-redesign-piano-sheet-music-355c4f9012f1",
      "title": "How I’d redesign piano sheet music",
      "text": "Here’s a new method for writing sheet music for piano that makes it easier to learn to play everyday songs. Traditional sheet music relies on symbols, scales and memorization, and can be difficult to learn and read, so this new notation uses visual cues by showing “fingers and hands” on keys. It’s read from top to bottom, with each circle being a finger placement (blue is the left hand, green is right), with the trailing colors showing how long you hold the notes. The gray lines are the black keys and the spaces between are the white keys, plus, the C keys are shaded for easier navigation.\n UPDATE: thank you all for the comments and feedback! Several people have mentioned this notation’s similarity to Guitar Hero, Rock Band, Rocksmith, and Dance Dance Revolution (DDR). They weren’t “direct” inspirations, but were likely subliminal ones for me… the format is very similar. Those comparisons are wonderful to hear, as those are popular games that allow anyone to interact with music, which is the purpose here as well.  \n As for similar notation apps and videos, like Synthesia, I’m aware of some of these (and quickly learning about others). My notation is similar to these, but I’m trying to build it to be more flexible, portable, simple, and “2-dimensional,” as most of the others are interactive or video-based ways of learning, which requires hardware and software (plus, I imagine, endless rewinding and looping to learn parts).  Anyway, back to the article!\n The Challenge \n 4 measures of “Let it Be” in traditional sheet music. It’s a simple song, but we see some complexity here.  Reading traditional sheet music can be difficult. Many people, like professional musicians and dedicated hobbyists, put in considerable time and effort to learn how to read it. Most people don’t.  \n Here are most of the symbols used in traditional sheet music. I count 20+ symbol types Guitar players who don’t read sheet music can lean on guitar tabulature as a learning tool, but a piano player’s alternatives are limited to learning by ear or from basic chords. Chords are simple, but sheet music is advanced. I’m trying to find the middle ground.\n About This Project This is a personal project where I’m trying to A) solve a problem, B) get a conversation started, and C) have fun thinking about a hobby I love. I’m addressing the casual piano player, one who wants to learn how to play songs well, but doesn’t have the time or attention to learn from traditional sheet music. This target user is probably learning easy, contemporary songs, and already knows what they sound like before they learn them. Maybe they’d even like to sing over the music!\n What this project is not: \n A professional project: There’s no “real user research” here, just a designer, some crayons, and friends willing to give feedback.  Exact visual forms and shapes: I’ve used basic shapes and formats. These are simply mockups intended to demonstrate a concept.  An attempt to “replace” traditional sheet music: sheet music has been around for over 500 years (thanks, Wikipedia), and it’s amazing! A professional instrumentalist can sit down in front of any piece of sheet music and play it, even if they’d never heard it before. That notation is flexible, precise, and has stood the test of time. But, as I mentioned, there’s a hefty learning curve. My new notation is for new audiences, not for those already proficient with traditional sheet music.\n So here’s what I came up with… \n A whole verse of “Let it Be,” by the Beatles, in my new notation style.  Overall Form It looks like a keyboard: doesn’t it? Recognizability is critical here, that the student sees a note on the sheet and can associate that with a physical location (a key). The challenge with this approach minimizing the amount of visual noise, so I chose to use thin lines to represent black keys, and the adjacent negative space represent white keys.\n Here’s an E major chord, shown on a keyboard, then on my notation.\n After trying a few versions, I ended up shading in the C notes as “anchors,” as C is a common “home base” for beginners. This neatly divides up the octaves, as well. Because I already use shading in the chords, I gave these anchors a thatched shading (diagonal lines). This allows chords to overlap the C notes while maintaining clear meaning for both; here’s an example: \n A chord that demonstrates what a C note looks like over the shaded area (it’s the left-most green note) A more “interactive” version of this notation could move the shading depending on what key the song is in — e.g., a song in “F” would have each F key shaded — but for the sake of printability and consistency, I stuck with C. Plus, some songs do change keys midway through; so leaving C’s shaded at all times avoids that complication.  \n Here’s how you count the beats in this notation: top to bottom, with the small spaces being beats, and the large spaces representing whole measures.  Measures and timing: I took a cue here from Stephen Few’s work on data visualization; blank space can be a very effective means to separate visual elements. So instead of dividing up beats and measures with lines (similar to traditional sheet music), I used white space.\n The narrow spaces represent “down” beats, which I’ve noted in the picture above. I think this is a succinct and sufficient system for this project, but there are two notable shortcomings: \n Precision: because I’m not using exact symbols and signs, where the notes fall is a bit open to interpretation. It’ll take having a “feel” for the song. But for learnability, it’s a worthwhile sacrifice.  Uncommon time signatures: This default state is based on 4 beats per measure, i.e., a “4/4” time signature, so it would need to be customized to fit a 3/4, 6/4, 7/4, or any number of less-common time signatures. For most contemporary music, this default 4/4 should be fine, but others will require custom printing. Below I’ve notated the first few measures of Vince Guaraldi’s Linus & Lucy (a.k.a. the “Peanuts” theme song) using a different time signature that has 8 beats per measure: \n Lastly, there are two additional advantages in the overall format used here: It’s easily printable. Without the notes and chords, this is just a lightweight black-and-white printout.\n It’s screen- and scroll-friendly. On a tablet or laptop, the top-to-bottom orientation works well with scrolling. If read on a digital device like this, it eliminates the need for page-turning, or pages at all.  Chords and notes \n A few chords and notes, as an example. Usually the blue chords would be to the left of the green ones, as those show left and right hands, respectively.  Overview: after a few iterations, I arrived at this upside-down-trident-shape. The dark circles represent fingers hitting piano keys — they can stand alone, or as part of a chord. The lighter, transparent vertical bars represent held notes, when your fingers stay on the key(s) after the initial hit. The lighter horizontal bar simply connects the notes in a chord (traditional sheet music does something similar). I made the horizontal “chord” lines thinner than the vertical “hold” lines to differentiate the meanings, and to minimize visual weight on the page.  \n Colors: different colors represent a player’s left hand (blue) versus right (green). It breaks up the content and helps the player understand which hand is doing what. However, this would still work for colorblind users (and on black/white printers, and handwritten), as the overall meaning persists even without color.  As for color selection: they’re light, cool colors for easy viewing… I’m sure a focused visual designer, with some research and testing, could come up with an optimal color combination for contrast and recognition.\n Circles: for “hits,” I started with circles as a nod to traditional sheet music. But after testing a few other shapes (e.g., upside-down triangles, oblique ovals, and X’s), circles maintain advantages: they’re easy to draw by hand, they’re the basic shape of a fingertip, and (even more than oblique ovals) they can be placed immediately adjacent to each other in a chord without losing meaning or crowding the area… see below.  \n This shows what two adjacent notes look like together (green chord). The circles allow you to distinguish two notes.  The rest of the chord shapes accommodate the circle. One disadvantage is that shades are hard to draw by hand, so you can see below that I use “squiggly lines” for shorthand:\n My handwritten draft of “You Are the Sunshine of My Life.” Some of the marks are different, but it’s pretty easy to write\n Below is the digitalized version of the above, that is, the first few measures of “You Are the Sunshine of My Life,” by Stevie Wonder. This song shows what this notation looks like for a more complex song that uses black keys.  \n The digital notation of this tune. This is technically my own arrangement, as the original uses a different electric piano part.  Other items on the sheet Chord names: the grey letters on the right side show the name of each chord. It’s unclear how well the intended audience knows chord names, so this is more of an optional item. Those that know chord names can use them. For those still learning chords, this combination could be a great learning tool. I’ve put the “simple” chord names here, instead of specifically noting any inversions or additional nuance.\n The small grey letters on the top are not chords; those indicate the corresponding C keys on an 88-key piano (e.g., C2 is the 2nd “C” note on a piano). This assists in learning and places the song in the correct octave.  \n Lyrics: this notation could stand alone, or with lyrics spelled out to the side. For contemporary songs, lyrics should help a player navigate the music.  \n For songs with repeated parts, you could save some space and stack multiple verses side-by-side; you can see this above. I’ve used numbers to indicate verses (as a player’s eyes would be darting back and forth between the chords and lyrics). A challenge is that multiple verses take up horizontal space, so I’ve had to cut the number of octaves shown; songs with wider octave spreads wouldn’t necessarily be able to accommodate this.  I initially tried to match the lyrics more closely with the notes being played, breaking it up almost word-for-word, but the result was messy, so I grouped the lyrics per-measure. It’s easier to read, and players should be able to figure it out.\n Foot pedal arrows: The foot pedal (a.k.a., the “sustain pedal”) control is something I struggled with. For me, the foot pedal is an afterthought… something that you hold down until things sound too messy, then you lift and press again (my childhood piano teacher would kill me for saying that).  \n I considered using a foot pedal indicator on the left side, but it would have competed for attention (on the opposite side of the page, to boot). I also considered incorporating it with the chords (say, an up or down arrow or edge on the notes to indicate pedal motion), but foot pedal action isn’t always associated with a new chord.  \n The pedal arrows, circled in red So I ended up with the up/down arrows, to demonstrate when a foot is lifted (up), and when it’s pressed (down). This is most often associated with chords, but we could use standalone arrows where appropriate.  \n Conclusion So that’s it: my take on what “piano tabulature music” should look like. Where traditional music is read like a second language (and is notably beautiful when “spoken” well), this should read more like an instruction manual: appropriate for beginners and intermediate players trying to play contemporary music. The learning curve is intended to be shallow enough to invite more piano players to learn and play.  \n If you’ve made it through this (long) piece; thanks for the time! Please recommend this piece and leave your comments… feedback is welcome. For direct contact, reach out to me at couch.ux [at] gmail [dot] com.  P.S., just for fun, let’s look at one more piece: this shows what a more complicated bass-line looks like, and demonstrates how a melody can be notated even when the player isn’t singing it. It also shows a different time signature, 2 beats per measure.\n P.P.S. Your feedback has been heard! I’m working on a second version of this notation, and I’ve responded to your collective feedback in the below article:\n Additional notes on piano tabulature (aka, the author’s reply to all the chatter) \n I’m excited and humbled by how much attention my new piano notation method has gotten (original post here). It’s… medium.com © Alex Couch, 2015. Unauthorized use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Alex Couch with appropriate and specific direction to the original content."
    },
    {
      "category": "Music",
      "id": 30002,
      "url": "https://medium.com/the-mission/10-awesome-places-to-find-background-music-for-video-14dd93d0d2f3",
      "title": "10 Awesome Places to Find Background Music for Video",
      "text": "Video content has exploded in popularity, and it’s no wonder. Consumers find video engaging, compelling and convincing — so much so that they’re anywhere from 64% to 85% more likely to buy after watching a product video.  \n In fact, video on a landing page can boost conversions by an astonishing 80%. Already, companies that use video on their website get 41% more traffic from search results than those that don’t, and by next year, you can expect 74% of all web traffic to be video.  Sure, every smartphone worth its salt has a decent video camera, but the highly competitive content arena today demands top quality content in all formats — including video.\n There’s a lot to think about, from actually shooting the video to post production, finding copyright free music and more. Equipment quality, lighting expertise, editing skill and audio optimization still matter a great deal (more than ever, in fact).  \n So while the barriers to entry for video creation have been reduced, the barriers to creating exceptional video have actually skyrocketed.  In this column, we’re going to explore some really useful places to find one element that can make your marketing and product videos way more professional and polished: background music.\n 10 Awesome Places to Find Background Music for Video \n Free Background Music Sites \n Free Music Archive This site lets you search by the type of Creative Commons license you’re willing to work with, or you can filter out only background music in the public domain. There are over 1,500 tracks tagged as public domain and allowing for commercial use, so it’s definitely worth checking out!\n GerryMusic \n Gerry Music offers tracks created by sound engineer and musician Gerry Black, who offers free background music for personal use with Creative Commons attribution. For marketing videos, you can license tracks for $18.  Incompetech\n Another musician’s site, this one features the works of Kevin MacLeod. His collections span jazz, rock, classics, macabre and more and tracks are available free of charge with proper attribution.  \n Internet Archives NetLabels This site houses thousands of tracks produced by independent virtual record labels who typically license their music in exchange for your credits attributing the work to them. Just make sure you read the Creative Commons license information and that the background music you’re after is approved for commercial use.\n Purchasing Quality Background Music for Video \n TuneTrack TuneTrack Commercial is a collection of royalty-free tracks with one-time license fees. The search engine is… not the best, as there aren’t a lot of ways to filter and sort tracks. But there are a few dozen artists featured on the site, which gives you some variety the single-composer sites are lacking.\n Opsound \n As the creators of opsound note in their licensing information, you’re free to use the music on their site for any purpose, but commercial users are encouraged to obtain permission from the creator. Opsound is an open community, so you’ll find all kinds of background music here. Quality will vary, but you’re more likely to find something truly original here, too.  BeatPick\n BeatPick has a way more powerful search engine and allows you to filter by genre, mood, vocals/instrument, artist, song topic and more. Once you choose a track, clicking “License this song” will let you indicate what you’re using it for, which dictates the cost of the license.  \n Jamendo Jamendo is unique in that it suggests different tracks for different types of video ads, including Facebook, YouTube, radio, TV and more. Pick your track and then click through for licensing information — $49 gets you a standard license for most online uses.\n MagnaTune \n If the ethics of music production and licensing are important to you, you’ll want to check out the background music licensing site that promises, “We are not evil.” MagnaTune works directly with artists and promises that 50% of the license fee goes directly to the music’s creator.  IMATunes\n IMATunes is a German company who guarantees their musical works are royalty free currently and in the future. It’s easy to filter music by mood, genre, tempo, or instruments.  \n Tips for Sourcing Background Music for Video Content creators are often unsure about what “copyright free music” actually means. Does it mean it’s free for you to use for whatever you want?\n Not exactly.  \n Typically, you need to either purchase a license, give attribution to the music creator, or use truly copyright free music for your video projects (also called public domain). Don’t confuse this with royalty-free, which means you won’t pay royalties but may pay a one-time licensing fee.  Get to know the different types of Creative Commons licenses so you can see at a glance what you need to do in order to use a piece of background music.\n Want to learn more about how video can help your business? Click here to learn 6 genius ways video can help accelerate the growth of your startup."
    },
    {
      "category": "Music",
      "id": 30003,
      "url": "https://medium.com/vantage/how-music-can-affect-you-as-a-creative-e6935bb2061c",
      "title": "How Music Can Affect You As A Creative",
      "text": "I’ve always felt like the music I listen to goes along with the pictures I photograph as if they were a movie. The other day I realized something else- the music I listen to affects my pictures.  I’ve always listened to music while editing my pictures. It’s hard to describe the music I listen to, but I guess you would call it instrumental hip hop/jazz. The music can have a strong rhythm and it might sound a little gritty.\n I usually listen to music like this while editing.\n Listen to the songs above. Then look at these pictures.  \n \n I don’t know about you, but I feel like my pictures do a good job of representing the music visually.  \n This might sound weird, but I think the music I listen to can affect my pictures. I only think it affects my pictures in small ways, but I try to pay attention to details, and if there’s something I can do that will make my pictures better, I’m going to do it.  \n I used to listen to music like this.  Listen to the songs above. Now look at these pictures.\n \n That’s the kind of music I used to like, and those are old pictures of mine. My music tastes have changed over time, and so has my editing style. Part of that is simply me becoming a better photographer and developing my own style, but I also feel like a little bit of it is the music. The music isn’t extremely different from what I listen to now, but I’m sure you can tell the differences. I’m also sure you can see the differences in the pictures; they’re brighter, more saturated, and tend to be a bit cooler in temperature.\n After noticing these differences I wanted to see if it was just me. I talked to some other photographers, and found the same thing. Their images also reflect the music they listen to. The people that listen to the more happy music tend to have brighter images and the people (like me) that listen to the darker music tend to have darker images.  \n There’s also research to back this up.  Apparently, our heart beat will actually begin to synch with the music we listen to. A slow heartbeat with a strong diastolic pressure can make our brain feel something sad or depressing. A very fast beat is obviously related to excitement, where dreamy rhythm with occasional upbeats can make us feel joy or love. The key of the music can also play a part. A minor key can sound sad and a major key can sound happy.  \n University of Missouri scientists found that in just two weeks of listening to happy music, a person’s mood could significantly change. In multiple studies run by Yuna Ferguson, half the participants were told to try to feel happier while listening to upbeat music. The others were told to do the same while listening to more neutral music. The participants that listened to the upbeat music reported feeling happy on a scale much higher than the participants who listened to the neutral music.  Now of course the music I listen to isn’t going to make me a zombie and take complete control of me while I edit my pictures, but it can affect my brain, and that can affect the way I edit a picture. I’m always going to go for a certain look when I’m editing, but the music I listen to could affect me enough to make a picture a little more contrasty, or a little darker.\n So, what does this mean?  Use music to your advantage while editing, painting, or doing any other art. If there’s a certain look you’re going for, try to pick some music that reflects that look. It might make your art just a little bit better."
    },
    {
      "category": "Food",
      "id": 40000,
      "url": "https://medium.com/@gidmk/organic-food-isnt-better-for-your-health-93a35584639d",
      "title": "Organic Food Isn’t Better For Your Health",
      "text": "Environmentally friendly? Maybe. Healthy? Probably not Pictured: Stock “Organic Food” photo. Apparently, if it comes in a basket, it’s organic An ongoing argument that I’ve had with almost every “clean eater” that I’ve ever met is about organic food. Virtually every person who tries to eat healthy, at one point or another, decides to go organic. It’s better for the environment, and getting rid of all those nasty chemicals has to be good for your health.  Right?  Pictured: Average farm worker, probably You see this everywhere. The first thing that every paleo proponent will earnestly tell you is that conventional farming causes everything from cancer to autoimmune disease, and pretty much everything in between. A quick glance online shows you people demonizing GMOs and pesticides left right and centre, with organics apparently the only safe choice in a sea of disease-causing nasties.  Pictured: Wrong But alarmist fearmongering about nasty chemicals is all the rage, and despite these claims we all seem to be getting stubbornly healthier every year.  So what does the evidence say about organic food?  What Is Organic?  The first thing to iron out is what organic food actually is. This is not such an easy question to answer, surprisingly. Not only does it differ from country to country, but the regulation and monitoring of organics can be so bad that in some places it’s hard to see any difference between conventional farming and organics at all.  However, a pretty useful definition can be found on the website “Healthy Holistic Living”, because it provides a window into the complete nonsense that makes up the health claims for organic foods: “ Organic foods are produced according to certain production standards. For crops, it means they were grown without the use of conventional pesticides, artificial fertilizers, human waste, or sewage sludge and that they were processed without ionizing radiation or food additives. For animals, it means they were reared without the routine use of antibiotics and without the use of growth hormones. In most countries, organic produce must not be genetically modified” Basically, the idea is that organic food should be farmed like we did in medieval times: no ‘artificial’ chemicals, no raw sewage, and animals that are at constant risk of nasty infection and death.  Pictured: Organic. Yum!  There are obvious issues with this. No farmer puts raw sewage on their crops, because that kills them. Banning artificial fertilizers and conventional pesticides means that actually you can use fertilizers and pesticides as long as they are natural and/or unconventional. Processing using ionizing radiation is both a) safe and b) kills nasty things like viruses and bacteria in your food.  I could go on. Actually, I will.  Genetic modification is neither a problem for human health nor actually forbidden in organic farming: the only thing that’s forbidden is genetic modification in a lab. Humans have been genetically modifying food for centuries through a practice known as hybridization, which is basically breeding plants to have the desired qualities. It’s how we eliminated seeds from the banana, for example.  Wheat was one of the first hybridized grain crops, increasing yields by hundreds of times Overall, it sounds as if the major factors of organic farming — pesticide use, non-GMO etc — might not have the health impact that so many people say organics provide.  The Evidence Whether organics are good for your health has been the subject of a lot of research. From tiny studies looking at animals and cells in a lab, to large, well-controlled human interventional studies, we’ve looked into the question quite a bit.  There have been a number of systematic reviews looking at the potential health benefits of organics. Systematic reviews are studies where scientists look at the entire body of literature, searching through hundreds of thousands of studies, to see what the evidence for and against a position is.  And if we look at the systematic reviews on organic food, we find the same answer time and again: organic food offers no health benefits whatsoever when compared to conventionally-farmed food.  None.  Organic food is no healthier for you than anything else.  Remember, if it doesn’t come in a basket it’s probably not really organic anyway This is no surprise. As I mentioned, the things organic food protects against may sound terrifying, but actually turn out not to be bad for you at all. Yes, pesticides can be dangerous if you chug down bottles of them, but the amount you get in the average tomato is in the order of nanograms. For reference, you have more formaldehyde in your body right now than pesticides.  Not so scary after all when you look at it that way, is it?  Bottom Line Organic food is popular for a number of reasons. There’s certainly evidence that it is better for the environment than conventional options, and if you want to spend a little extra to make an impact protecting biodiversity then I say good for you.  But the fear of conventional farming is simply irrational. There is good evidence that pesticides in the amounts that you’ll find in most supermarket food has no impact on human health whatsoever. Conventional farming has revolutionized the world by allowing easy access to fresh food all year round — if anything, conventional farming has been responsible for saving many millions of lives worldwide.  The promotion of organic food is yet another example of the naturalistic fallacy: that things are healthy because they are natural. This is boring nonsense, as anyone who has been bitten by a natural viper or had natural tapeworms could tell you. Organic food is just another way for con artists to sell health because people are afraid of what they don’t understand.  Ultimately, there is one good reason to eat organic: the environment.  That’s it.  The evidence shows that organics are no better for your health at all."
    },
    {
      "category": "Food",
      "id": 40001,
      "url": "https://medium.com/alex-couch-s-portfolio/how-i-d-redesign-piano-sheet-music-355c4f9012f1",
      "title": "How I’d redesign piano sheet music",
      "text": "Here’s a new method for writing sheet music for piano that makes it easier to learn to play everyday songs. Traditional sheet music relies on symbols, scales and memorization, and can be difficult to learn and read, so this new notation uses visual cues by showing “fingers and hands” on keys. It’s read from top to bottom, with each circle being a finger placement (blue is the left hand, green is right), with the trailing colors showing how long you hold the notes. The gray lines are the black keys and the spaces between are the white keys, plus, the C keys are shaded for easier navigation.\n UPDATE: thank you all for the comments and feedback! Several people have mentioned this notation’s similarity to Guitar Hero, Rock Band, Rocksmith, and Dance Dance Revolution (DDR). They weren’t “direct” inspirations, but were likely subliminal ones for me… the format is very similar. Those comparisons are wonderful to hear, as those are popular games that allow anyone to interact with music, which is the purpose here as well.  \n As for similar notation apps and videos, like Synthesia, I’m aware of some of these (and quickly learning about others). My notation is similar to these, but I’m trying to build it to be more flexible, portable, simple, and “2-dimensional,” as most of the others are interactive or video-based ways of learning, which requires hardware and software (plus, I imagine, endless rewinding and looping to learn parts).  Anyway, back to the article!\n The Challenge \n 4 measures of “Let it Be” in traditional sheet music. It’s a simple song, but we see some complexity here.  Reading traditional sheet music can be difficult. Many people, like professional musicians and dedicated hobbyists, put in considerable time and effort to learn how to read it. Most people don’t.  \n Here are most of the symbols used in traditional sheet music. I count 20+ symbol types Guitar players who don’t read sheet music can lean on guitar tabulature as a learning tool, but a piano player’s alternatives are limited to learning by ear or from basic chords. Chords are simple, but sheet music is advanced. I’m trying to find the middle ground.\n About This Project This is a personal project where I’m trying to A) solve a problem, B) get a conversation started, and C) have fun thinking about a hobby I love. I’m addressing the casual piano player, one who wants to learn how to play songs well, but doesn’t have the time or attention to learn from traditional sheet music. This target user is probably learning easy, contemporary songs, and already knows what they sound like before they learn them. Maybe they’d even like to sing over the music!\n What this project is not: \n A professional project: There’s no “real user research” here, just a designer, some crayons, and friends willing to give feedback.  Exact visual forms and shapes: I’ve used basic shapes and formats. These are simply mockups intended to demonstrate a concept.  An attempt to “replace” traditional sheet music: sheet music has been around for over 500 years (thanks, Wikipedia), and it’s amazing! A professional instrumentalist can sit down in front of any piece of sheet music and play it, even if they’d never heard it before. That notation is flexible, precise, and has stood the test of time. But, as I mentioned, there’s a hefty learning curve. My new notation is for new audiences, not for those already proficient with traditional sheet music.\n So here’s what I came up with… \n A whole verse of “Let it Be,” by the Beatles, in my new notation style.  Overall Form It looks like a keyboard: doesn’t it? Recognizability is critical here, that the student sees a note on the sheet and can associate that with a physical location (a key). The challenge with this approach minimizing the amount of visual noise, so I chose to use thin lines to represent black keys, and the adjacent negative space represent white keys.\n Here’s an E major chord, shown on a keyboard, then on my notation.\n After trying a few versions, I ended up shading in the C notes as “anchors,” as C is a common “home base” for beginners. This neatly divides up the octaves, as well. Because I already use shading in the chords, I gave these anchors a thatched shading (diagonal lines). This allows chords to overlap the C notes while maintaining clear meaning for both; here’s an example: \n A chord that demonstrates what a C note looks like over the shaded area (it’s the left-most green note) A more “interactive” version of this notation could move the shading depending on what key the song is in — e.g., a song in “F” would have each F key shaded — but for the sake of printability and consistency, I stuck with C. Plus, some songs do change keys midway through; so leaving C’s shaded at all times avoids that complication.  \n Here’s how you count the beats in this notation: top to bottom, with the small spaces being beats, and the large spaces representing whole measures.  Measures and timing: I took a cue here from Stephen Few’s work on data visualization; blank space can be a very effective means to separate visual elements. So instead of dividing up beats and measures with lines (similar to traditional sheet music), I used white space.\n The narrow spaces represent “down” beats, which I’ve noted in the picture above. I think this is a succinct and sufficient system for this project, but there are two notable shortcomings: \n Precision: because I’m not using exact symbols and signs, where the notes fall is a bit open to interpretation. It’ll take having a “feel” for the song. But for learnability, it’s a worthwhile sacrifice.  Uncommon time signatures: This default state is based on 4 beats per measure, i.e., a “4/4” time signature, so it would need to be customized to fit a 3/4, 6/4, 7/4, or any number of less-common time signatures. For most contemporary music, this default 4/4 should be fine, but others will require custom printing. Below I’ve notated the first few measures of Vince Guaraldi’s Linus & Lucy (a.k.a. the “Peanuts” theme song) using a different time signature that has 8 beats per measure: \n Lastly, there are two additional advantages in the overall format used here: It’s easily printable. Without the notes and chords, this is just a lightweight black-and-white printout.\n It’s screen- and scroll-friendly. On a tablet or laptop, the top-to-bottom orientation works well with scrolling. If read on a digital device like this, it eliminates the need for page-turning, or pages at all.  Chords and notes \n A few chords and notes, as an example. Usually the blue chords would be to the left of the green ones, as those show left and right hands, respectively.  Overview: after a few iterations, I arrived at this upside-down-trident-shape. The dark circles represent fingers hitting piano keys — they can stand alone, or as part of a chord. The lighter, transparent vertical bars represent held notes, when your fingers stay on the key(s) after the initial hit. The lighter horizontal bar simply connects the notes in a chord (traditional sheet music does something similar). I made the horizontal “chord” lines thinner than the vertical “hold” lines to differentiate the meanings, and to minimize visual weight on the page.  \n Colors: different colors represent a player’s left hand (blue) versus right (green). It breaks up the content and helps the player understand which hand is doing what. However, this would still work for colorblind users (and on black/white printers, and handwritten), as the overall meaning persists even without color.  As for color selection: they’re light, cool colors for easy viewing… I’m sure a focused visual designer, with some research and testing, could come up with an optimal color combination for contrast and recognition.\n Circles: for “hits,” I started with circles as a nod to traditional sheet music. But after testing a few other shapes (e.g., upside-down triangles, oblique ovals, and X’s), circles maintain advantages: they’re easy to draw by hand, they’re the basic shape of a fingertip, and (even more than oblique ovals) they can be placed immediately adjacent to each other in a chord without losing meaning or crowding the area… see below.  \n This shows what two adjacent notes look like together (green chord). The circles allow you to distinguish two notes.  The rest of the chord shapes accommodate the circle. One disadvantage is that shades are hard to draw by hand, so you can see below that I use “squiggly lines” for shorthand:\n My handwritten draft of “You Are the Sunshine of My Life.” Some of the marks are different, but it’s pretty easy to write\n Below is the digitalized version of the above, that is, the first few measures of “You Are the Sunshine of My Life,” by Stevie Wonder. This song shows what this notation looks like for a more complex song that uses black keys.  \n The digital notation of this tune. This is technically my own arrangement, as the original uses a different electric piano part.  Other items on the sheet Chord names: the grey letters on the right side show the name of each chord. It’s unclear how well the intended audience knows chord names, so this is more of an optional item. Those that know chord names can use them. For those still learning chords, this combination could be a great learning tool. I’ve put the “simple” chord names here, instead of specifically noting any inversions or additional nuance.\n The small grey letters on the top are not chords; those indicate the corresponding C keys on an 88-key piano (e.g., C2 is the 2nd “C” note on a piano). This assists in learning and places the song in the correct octave.  \n Lyrics: this notation could stand alone, or with lyrics spelled out to the side. For contemporary songs, lyrics should help a player navigate the music.  \n For songs with repeated parts, you could save some space and stack multiple verses side-by-side; you can see this above. I’ve used numbers to indicate verses (as a player’s eyes would be darting back and forth between the chords and lyrics). A challenge is that multiple verses take up horizontal space, so I’ve had to cut the number of octaves shown; songs with wider octave spreads wouldn’t necessarily be able to accommodate this.  I initially tried to match the lyrics more closely with the notes being played, breaking it up almost word-for-word, but the result was messy, so I grouped the lyrics per-measure. It’s easier to read, and players should be able to figure it out.\n Foot pedal arrows: The foot pedal (a.k.a., the “sustain pedal”) control is something I struggled with. For me, the foot pedal is an afterthought… something that you hold down until things sound too messy, then you lift and press again (my childhood piano teacher would kill me for saying that).  \n I considered using a foot pedal indicator on the left side, but it would have competed for attention (on the opposite side of the page, to boot). I also considered incorporating it with the chords (say, an up or down arrow or edge on the notes to indicate pedal motion), but foot pedal action isn’t always associated with a new chord.  \n The pedal arrows, circled in red So I ended up with the up/down arrows, to demonstrate when a foot is lifted (up), and when it’s pressed (down). This is most often associated with chords, but we could use standalone arrows where appropriate.  \n Conclusion So that’s it: my take on what “piano tabulature music” should look like. Where traditional music is read like a second language (and is notably beautiful when “spoken” well), this should read more like an instruction manual: appropriate for beginners and intermediate players trying to play contemporary music. The learning curve is intended to be shallow enough to invite more piano players to learn and play.  \n If you’ve made it through this (long) piece; thanks for the time! Please recommend this piece and leave your comments… feedback is welcome. For direct contact, reach out to me at couch.ux [at] gmail [dot] com.  P.S., just for fun, let’s look at one more piece: this shows what a more complicated bass-line looks like, and demonstrates how a melody can be notated even when the player isn’t singing it. It also shows a different time signature, 2 beats per measure.\n P.P.S. Your feedback has been heard! I’m working on a second version of this notation, and I’ve responded to your collective feedback in the below article:\n Additional notes on piano tabulature (aka, the author’s reply to all the chatter) \n I’m excited and humbled by how much attention my new piano notation method has gotten (original post here). It’s… medium.com © Alex Couch, 2015. Unauthorized use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Alex Couch with appropriate and specific direction to the original content."
    },
    {
      "category": "Food",
      "id": 40002,
      "url": "https://medium.com/impossible-foods/the-mission-that-motivates-us-d4d7de61665",
      "title": "The Mission that Motivates Us",
      "text": "Impossible Foods began in 2011 with an ambitious goal: To drastically reduce humanity’s destructive impact on the global environment by completely replacing the use of animals as a food production technology. We intend to accomplish this mission within two decades by creating the world’s most delicious, nutritious, affordable and sustainable meat, fish and dairy foods directly from plants.  An Urgent Problem Since prehistoric times, humans have exploited animals as a rudimentary technology to transform cheap, abundant plant biomass into highly valued, nutrient-dense foods: meat, fish and dairy. These foods continue to provide an important source of nutrition and one of the greatest sources of pleasure in the daily lives of billions of people around the world.  But our use of animals as a food-production technology has brought us to the verge of environmental catastrophe: The destructive impact of animal agriculture on the global environment far exceeds that of any other technology on Earth. The greenhouse gas footprint of animal agriculture rivals that that of every car, truck, bus, ship, airplane, and rocketship combined. Animal agriculture pollutes and consumes more water than any other industry.  Raising animals for food makes up the vast majority of the land footprint of humanity. All the buildings, roads and paved surfaces in the world occupy less than one percent of Earth’s land surface, while more than 45% of the land surface of Earth is currently in use as land for grazing or growing feed crops for livestock. The global demand for meat, fish and dairy foods is a primary driver of the ongoing meltdown in diverse wildlife populations and ecosystems on land and in oceans, rivers and lakes. Unless we act quickly to reduce or eliminate the use of animals as technology in the food system, we are racing toward ecological disaster.  And yet expecting people to eliminate or even reduce their consumption of the animal meat, fish and dairy foods they love is completely unrealistic. We’re not going to solve this problem by pleading with consumers to eat beans and tofu instead of meat and fish. Even many of the world’s most ardent environmentalists, acutely aware of the destructive impact of their diet, continue to eat animals every day. Despite a growing recognition that animal agriculture is destroying the planet, the global demand for animal-derived food continues to rise, now outpacing human population growth. We need to solve this problem another way.  What IF there’s a better way?  Most people erroneously conflate meat, fish and milk (the foods) with the animals that produce them (the production technology). Even the names of many of these foods imply an inseparable link to the animal technology we’ve historically used to produce them. It turns out that consumers love meat, fish and dairy foods not because they come from animals, but in spite of the fact that they come from animals. To most consumers, the fact that we currently use animals to produce these foods is not a valued feature, but a necessary (or so we’ve assumed) evil.  Not only are animals not the only way to produce world’s favorite foods; they aren’t even the best way. Until today, the only technology we’ve known that can turn plants into meat has been animals. But cows, pigs, chicken and fish didn’t evolve to be eaten. They’re terribly inefficient at turning plants into meat, and there’s no reason to think they’ve even come close to reaching the potential for deliciousness in meat.  Six years ago it was only a hypothesis, but today we know that by understanding and optimizing the molecular mechanisms that underlie the deliciousness of meat, we will be able to transform natural ingredients from plants into meat that outperforms the best beef from a cow — not just in sustainability, cost and nutritional value, but in flavor, texture, craveability and even “meatiness.” Taking the horse out of horsepower New products and new technologies replace their predecessors by doing a better job of giving consumers what they want and need. The surest strategy for replacing the most destructive technology on Earth is to deliberately create foods that deliver greater pleasure and value to consumers of meat, fish and dairy foods, then offer them as a choice — and let market demand take care of the rest. If this sounds implausible, even impossible, consider a historical precedent in which a ubiquitous, deeply-rooted, traditional animal-based technology was rapidly and completely replaced by a categorically better technology: Two hundred years ago, the horse was synonymous with powered transportation. Nobody imagined that a cart could move at all, let alone move faster, without the horse to pull it. Horses were fundamental to how the world worked — from how we tilled fields to how we communicated (the Pony Express). But within a few decades, horses were rapidly and all but completely replaced as a transportation technology. They were replaced not because they had an extremely destructive impact on the environment (they did), but because a new technology (automobiles) outperformed the horse in delivering value to consumers. The market quickly decided that cars and other forms of mechanized transportation provide better value than animal-powered transportation, and the rest is history.  For many years, people in many cultures have developed plant-based foods that purport to be replacements for meat, replicating some meaty attributes sufficiently well to satisfy some consumers who are seeking a non-animal-based alternative. But none of these products has taken a serious share of the market for meat; they’ve fallen far short in delivering the powerful array of sensory pleasures that meat lovers crave. Before I even started Impossible Foods, I knew that our success would depend on creating foods that not only match but categorically outperform meat from animals in taste, nutrition and value.  Nobody was seriously working on this problem — the most important and urgent problem in the world — so I quit my dream job as a biochemistry professor at Stanford University School of Medicine to found Impossible Foods.  Science + Nature = Food Science has always played a critical role in the history of food. All the foods we eat today are the result of millennia of scientific research: exploration, discovery and experimentation that taught us which parts of which plants or animals are edible, and how to process them (for instance, by grinding, cooking, soaking, fermenting or blending) to make them safe, nutritious and delicious. The world’s diverse cuisines have evolved from centuries of experimentation, discovering myriad ways to combine selected ingredients to create dishes that are better than the sum of the parts.  We started by building the best team of scientists and engineers ever to work on food — a team worthy of taking on the most important challenge in the world. We recognized when we started that we didn’t yet know how to do it, nor did we know the toolkit of plant ingredients we would need. We would have to discover the answers.  Our team approached the challenge of creating better meat with the same blend of creativity and concentration, and many of the same tools and techniques, that biomedical scientists use to understand how our bodies work and to discover treatments for previously incurable diseases: Start with the hard fundamental research required to understand the basic principles and molecular mechanisms responsible for the flavors, aromas, textures and juiciness that make meat delicious and craveable; then, discover scaleable plant sources of the specific proteins and other nutrients required to reproduce the magic of meat.  Once we understand how animal meat performs its magic at a mechanistic level, we don’t have to limit ourselves to replicating existing meats; we can use that knowledge to make foods that outperform today’s animal-derived foods in all the ways that consumers value. We can combine simple ingredients from natural sources in easy-to-understand recipes to produce the best meat in the world — from plants. Although the science involved in finding and choosing precisely the right ingredients and recipes is as sophisticated as any biomedical research, the ingredients and recipes themselves can be remarkably simple.  One of our earliest and most important discoveries (based on a hunch) was that the “magic ingredient” responsible for the unique flavors and aromas of meat is “heme.” Heme is an iron-containing molecule that occurs naturally in every cell of every animal and plant. It’s an essential molecular building block of life — one of nature’s most ubiquitous molecules — most familiar as the molecule that carries oxygen in your blood, but also a critical part of the system every cell uses to “burn calories” from food to produce the energy that keeps you alive. Heme is super abundant in animal muscle, and it’s the abundance of heme that makes meat uniquely delicious.  You can’t make meat without heme. To satisfy the global demand for meat with a tiny fraction of the environmental impact, Impossible Foods had to develop a scalable way to make heme without animals. We found that by adding a plant gene to yeast cells, we could use fermentation to produce a heme protein naturally found in plants, called leghemoglobin, in essentially unlimited quantities with a tiny fraction of the environmental impact. The heme in the Impossible Burger is identical to the heme humans have been consuming for hundreds of thousands of years in meat — delivering all the unique taste and bioavailable iron content of beef, using but a fraction of the natural resources.  Today’s Impossible Burger requires approximately 75% less water and 95% less land, and generates about 87% lower greenhouse gas emissions than a conventional burger from cows. And while it has the iron and protein, the Impossible Burger is produced without using hormones or antibiotics and contains no cholesterol.  Creating meat is not easy. Even after we discovered the magical role of heme, our R&D team was in for a hard, multifaceted scientific challenge. Our first prototypes were terrible. (Our flavor team once compared an early prototype burger to rancid polenta.) But that’s the way innovation works. Over several years, our product got better and better. In blind taste tests, more and more people say they prefer our product over a burger from cows — and our results keep improving. In a recent test, the Impossible Burger “ran even” with conventional ground beef; about half the tasters (all meat-loving omnivores, no vegetarians or vegans) said they preferred the Impossible Burger over the ground beef burger, without knowing what it was or whether it was different from the burger from cows. We’re not stopping there.  Our goal is to beat the cow in blind taste tests by a substantial margin.  3–2–1…Liftoff We are actively developing a wide range of delicious meat and dairy products to replace their animal-derived counterparts — a defining goal of our R&D strategy. But as a young startup we wanted to focus our limited resources on a single product that delivered maximum impact and would convincingly show the world that delicious meat doesn’t have to come from animals.  Beef production is the most environmentally destructive segment of the livestock industry. And ground beef is the most popular meat choice in the United States, accounting for about half of our total beef consumption. Versatile and convenient, it’s the basis for the iconic American burger, and it’s a mainstay of dumplings, tacos, pizza, sauces, chili, casseroles, meatballs, soups and more. So making a product that could replace ground beef would have the greatest environmental benefits. And, as the iconic “all-American meat,” our product could convey the message that, in the near future, the best meat will come from plants.  We’re new at this. When we launched our first product, we knew we would need to scale up gradually so that we could learn and iterate. That meant that our first production scale would be small, and we wanted every burger sold to have the highest possible impact in creating our brand. As we were testing prototypes in 2014–2016, we encountered renowned chefs who loved the Impossible Burger and were keen to serve it in their restaurants. So, with very limited supply, we debuted in 2016 in the award-winning restaurants of four top chefs: David Chang, Traci Des Jardins, Tal Ronnen and Chris Cosentino. They helped us send a powerful message that great meat doesn’t have to come from animals.  In 2017, we focused on scaling up our production — a critical part of creating a profitable growth engine. We began making burgers in our food manufacturing facility in Oakland in September 2017, and by January 2018, the Impossible Burger was being served in about 500 restaurants throughout the United States (a 100-fold increase in one year). These restaurants run the gamut, from multi-generation Midwest burger joints to restaurants helmed by international celebrity chefs to beloved multi-unit chains. As we continue to scale, our products will become more affordable and widely available in restaurants, grocery stores and online — a better value overall than their animal-derived predecessors.  And that’s just the beginning. Over the next few years, the best pork, the best chicken, the best fish, cheese, eggs the world has ever seen will be made directly from plants, using the knowhow and tools Impossible Foods is developing today. The biggest realization we’ve had so far is that the replacement of animals as the dominant technology for producing meat, fish and dairy foods is inevitable and coming soon. In the next decade, all of the foods we get today from animals will begin to be replaced by plant-based counterparts that outperform them in every way that matters to consumers — taste, nutrition and value — and trounce them in sustainability.  Joining the movement to #MakeEarthGreatAgain I’m often asked whether Impossible Foods is a tech startup or a food company. We’re both. But more importantly, we are a planet company. Our real “product,” the measure by which we determine success, is a thriving planet for future generations.  Impossible Foods started in California’s Silicon Valley, but our home is Earth, and our mission is global. Our impact will depend on developing local supply chains and production facilities and enabling local entrepreneurs and farmers to build their own businesses using the tools we’re developing. We intend to focus heavily on leveraging the inherently greater efficiency of plant-based foods to create mainstream, mass-market foods that address the critical nutritional and food-security challenges in the world’s poorest communities.  Addressing the greatest environmental, geopolitical, and public health challenges starts by making the global food system sustainable. By replacing animals in the food system with delicious, nutritious meats made from plants, vast swathes of the Earth’s entire land surface could be spared for biodiversity and wildlife. As natural ecosystems are restored and recovered land converted to plant biomass, photosynthesis (the most reliable and proven carbon capture method, optimized by billions of years of evolution), could stabilize and even reduce global atmospheric CO2. Reversing the destruction and degradation of wildlife habitat would also save untold numbers of species from extinction.  By drastically reducing global demand for land and water, success in our mission could reduce conflict over land and water rights, improving geopolitical security. At-risk farmers would have safer jobs and more certain futures, with less fear over climate change. Reducing stress on land and water and improving access to high-protein and iron-rich foods at lower costs would mean fewer conflicts over scarce resources. Bypassing animals and making meat directly from plants would return land to native ecosystems, enabling us to reduce global pesticide and fertilizer use. The urgent public health risk of antibiotic-resistant pathogens and potential pandemic viruses — which evolve and are incubated in concentrated animal feeding operations — would recede.  Decreasing the environmental footprint of food is exponentially more effective — and easier — than switching from gas-powered to electric vehicles, eliminating coal-fired power or building a completely renewable energy grid. Increasing food chain sustainability will ensure that we can feed 10 billion people by 2050, reduce conflict and inequality that leads to humanitarian crises and wars, and make the economy more inclusive. And we will eliminate the confinement, misery and slaughter of billions of animals per year.  Some of the world’s most successful entrepreneurs are working today on audacious projects to colonize other planets, on the premise that the environmental catastrophes humans are creating will soon render Earth uninhabitable. Unlike some skeptics, I admire the entrepreneurs’ ingenuity. But Mars is a feeble excuse for a planet compared to the one we already have, so I’m doubling down on planet Earth. Instead of ditching it, let’s “make Earth great again.”"
    },
    {
      "category": "Food",
      "id": 40003,
      "url": "https://byrslf.co/how-i-taught-myself-to-love-healthy-food-de14501d258f",
      "title": "How I taught myself to love healthy food",
      "text": "Last night, we had a party at my house. Everyone else ordered pizza and I cooked a plate full of veggies. All of my friends asked me, “My god, do you want a share?” and “Are you on a diet?” or “Why are you so hard on yourself?” I told them was that I was fine and really enjoying my meal, but they didn’t believe me. Hence this article.  I used to really not care about what I ate. I would have burgers, schnitzels and sweets all the time and go to McDonald’s every week. While working in food tech, I started to get more interested in nutrition and began to understand that I need to have a healthier diet.  “The driving forces that control us are pain and pleasure.” — Tony Robbins It’s one thing to understand the benefits of eating healthy, and I’m sure you are already convinced about that, but it is more difficult to act accordingly. While reading Awakening the Giant by Tony Robbins a couple of weeks ago, I understood why it is so difficult. It is because people keep associating healthy food with pain and unhealthy food with pleasure. This is what happens when you follow a strict diet instead of changing these associations. When I did this, it only worked short term for me.  “In order for change to last, we must link pain to our old behavior and pleasure to our new behavior” — Tony Robbins What made me consistently eat healthy is the association of healthy food with pleasure and the association of unhealthy food with pain. How did I tackle this?  Sensory association: I stopped associating unhealthy food with pleasant sensory satisfaction. After a few TED talks and meditation courses, I now understood that my taste for sweets and chips came mainly out of an addiction or emotional links, and that it could be changed. I knew this good taste was a perception of mine more than something that is necessarily inherent in the food.  Medium-term association: Instead of focusing on short-term satisfaction, I focused on the medium-term benefits of changing to eating healthy. When I started consciously associating the feeling of being unwell and sluggish with the unhealthy food I had eaten earlier, it helped me to link the unhealthy food with pain.  Psychological association: Instead of associating McDonald’s with freedom, I associated it with consumption and manipulation. When I used to go to McDonald’s, I used to think I was expressing my free will. “Society tells me to eat healthy? Well, screw that. It’s my choice and I’ll eat at McDonald’s.” Marketers had done a good job and they had succeeded in making me associate McDonald’s with free will. What do I see now when I see a McDonald’s? A company that manipulated me and made me love them so they could sell me food that was bad for me and make money. No wonder I don’t enjoy McDonald’s that much now… Conclusion Here is how I associated unhealthy food with pain, and similarly I associated healthy foods with pleasure.  I often hear that discipline is a muscle we can train. It seems like it; but actually, what I think happens is that you can start with discipline and feel the benefits of what you are doing, leading you to associate, sometimes unconsciously, what used to feel painful with pleasure, meaning that you don’t need discipline anymore.  This is why I tell my friends there is no need to admire my discipline when I eat those veggies. I don’t really need any!  PS: I make it sound like it’s super easy. It took me a while and is still a work in progress. I’m not a robot and I still make sure I don’t have sweets at my place to avoid temptation. I obviously enjoy a burger or a pizza once in a while. I’m also currently trying to use the same method for work or exercise and start to feel the benefits.  If you like this article, don’t hesitate to clap, follow me, react and share. I would love to discuss further :) You can always contact me at alex@unlockt.me"
    },
    {
      "category": "Sports",
      "id": 50000,
      "url": "https://medium.com/@johngreen/the-greatest-sports-story-never-told-c9039e82967e",
      "title": "The Greatest Sports Story Never Told",
      "text": "Most of my professional life has been devoted to telling stories for and about teenagers. But after my novels The Fault in Our Stars and Paper Towns were adapted into movies, I pitched the producers (Temple Hill) and studio (Fox 2000) of those movies a somewhat different story, about the greatest underdog sports story you’ve never heard, starring a bunch of middle-aged people with absolutely no athletic talent. And today, an agreement was announced, so I wanted to drop by Medium and explain why my next film project is about not American teenagers but a lower league English football club.  So, okay: In May of 2002, the English Football Association gave the owners of a club called Wimbledon F.C. permission to move 70 miles away, to a town called Milton Keynes. Despite fervent protests from Wimbledon fans, the FA decided that it was “not in the wider interests of football” to have a club based in Wimbledon.  This happens all the time in American sports — the Brooklyn Dodgers become the LA Dodgers, the Baltimore Colts became the Indianapolis Colts — but it doesn’t happen in England, where football teams are not franchises but rather community assets. For many Wimbledon fans, to lose their club was to lose their community. As one protest banner read, “A club is for life, not just for profit.” Wimbledon fans call themselves “Wombles” after a popular British children’s show.  Despite the defiant graffiti and protests, it appeared Wimbledon would be without a football club until a group of supporters decided they would just start a team. Of course, there were some initial challenges — for instance, none of them had any experience running a football club, and they also had no uniforms, no sponsors, no coaches, and no players.  They held open tryouts in a public park, hired a coaching staff, rented a stadium, found a video game company to sponsor them, and began the 2002–2003 season in ninth tier of English football. (In England, each season the teams that finish at the top of a league are promoted to the next tier up and those finishing at the bottom are relegated to the league below. If, for instance, Manchester United finished bottom of the league for four consecutive seasons, they’d be relegated from the Premier League to the Championship, then to League One, then to League Two, and then out of the professional Football League altogether.) Of course, the quality of the football played in England’s ninth tier leaves a bit to be desired, but Wimbledon had a club again, and it would never be taken away, because each fan owned an equal share of the new team, now known as AFC Wimbledon. (There are various stories on the provenance of the “AFC,” but some say it stands for “A Fans’ Club.”) And then a funny thing happened: They started winning. In fact, between February 2003 and December 2004, they didn’t lose a single game. They bought a small stadium, and got promoted to the eighth tier, and then the seventh. They rebuffed wealthy investors, preferring to remain fan-owned, even if it meant never getting back to the Football League.  All along the way, they’ve sung, “Show Me the Way to Plough Lane,” the name of their now-demolished stadium. “I’m tired and I want to go home. / I had a football ground twenty years ago / And I want one of my own.” By 2011, just nine years after forming, AFC Wimbledon had worked their way back to the fifth tier of English football, just one promotion away from the Football League. They made it to the playoffs, and then to the final, where the game went to a penalty shootout. The Dons’ 19-year-old goalkeeper Seb Brown saved two penalties. And then Wimbledon’s captain, Danny Kedwell, stepped up to take the final penalty. In his 10-year career, Kedwell had never played a game in the Football League, and with one penalty he could take himself and his club there. What happened? Well, watch the video with commentary from the volunteers at Radio WDON.  oh Danny Kedwell, you are the love of my life, oh Danny Kedwell… And so it came to pass that a bunch of middle-aged people with normal jobs and no idea how to run a sports team founded a club that, in nine short years, rose through the ranks of amateur soccer and became a professional Football League club.  In 2013, when AFC Wimbledon defeated the team that had moved to Milton Keynes, it was hardly news. The Wimbledon fans sang, “Where were you / where were you / Where were you when you were us?” And they all stood and sang, “Stand up if you own your club.” And they sang, as they always do, “Show me the way to Plough Lane.” Today, Wimbledon are 10th in League Two, and their plans for a new stadium in Wimbledon are well underway. And off the pitch, they continue to be a progressive force — AFC Wimbledon were the first club in England, for instance, to take a stand against homophobia.  Anti-homophobia banner at a recent AFC Wimbledon match.  By choosing community over profit, and by reminding us that hope is necessary even when it is also preposterous, AFC Wimbledon has shown the world the way to Plough Lane.  Football is a game where adults can sing together and cry together, a rectangle upon which we can see in manageable scale all that is good and terrible about people, all the injustice and folly and joy of human life. And when that rectangle was taken away from Wimbledon, they built it again, That resilience represents the very best of us, and I am so excited to be part of the team working to share that story with a wider world."
    },
    {
      "category": "Sports",
      "id": 50001,
      "url": "https://medium.com/@Flipboard/how-d-you-get-that-picture-bob-martin-s-glorious-sports-photography-66ef341d7960",
      "title": "How’d You Get That Picture? Bob Martin’s Glorious Sports Photography",
      "text": "Bob Martin is an award-winning sports photographer who’s shot every major sporting event on the planet, from the last 13 Summer and Winter Olympics to elephant polo and horse racing on ice. His photographs have been published in Sports Illustrated, Time, Life Magazine and The New York Times, among many other places, and he’s received more than 60 prestigious awards, including British Sports Photographer of the Year (three times!) and the World Press Photo Sports Picture of the Year. Now he’s a consultant for the International Olympic Committee and the Rio 2016 Olympics, and the author of 1/1000th: The Sports Photography of Bob Martin. Here’s a look at his stunning work and the story of one particularly great photo.  I have covered every Olympic Games since 1984, which means I have shot 15 games in freezing blizzards and oppressive heat. There is nothing like the Olympics and they provide the opportunity to make pictures that are so completely different from what most sports photographers do on a weekly basis. There are enough different events in the track and field alone to produce a book. There is no safety net during the 15 days; no chance to redo a picture, no chance to find the “right” position after it’s over, no chance to reshoot in the right light if you are stuck with an overcast day or a terrible background.  My approach to the Olympics has evolved over the years. I started out on the finish line making wire service pictures for Allsport. When I then moved to Sports Illustrated in 1994, I made an effort to leave pack photojournalism behind. I went to the more unusual Olympic events like equestrian and road cycling where I could try to find and show a sense of place in my pictures. Rather than sit at the finish line, I chased the light at the track and would set up all alone on the third turn where I might get lucky and hopefully a American may drop their baton in the relay! I went to the “up” positions and the high-risk, high-reward places where few photographers roamed. I concentrated on the tears and cheers aspect of the athletes. I wanted to make iconic, signature pictures that would be used as double trucks in magazines.  This picture was shot during the 2013 World Swimming Championships in Barcelona and is one of my favorites in the book I’ve just completed, 1/1000th, produced by Vision Sports publishing. It is of the Russian synchronized swimming team that won the gold medal in the team final.  Synchronized swimming can often make good pictures, especially when outside in the sunshine. However, in Barcelona this time it was indoors…I presumed I was doomed and was struggling to find an interesting idea or way to shoot. Luckily, I noticed during qualification heats, the TV crews turned on their interview lights at the side of the pool for the last few competitors. I found one angle where the TV lights backlit the swimmers against a rather good, dark backdrop. I managed, for once, to avoid the advertisements all around the pool. However, it necessitated lying on my oversized belly in the corner of the pool in an unfortunately damp position.  As the competition came to a climax yet more of the TV crews put on their interview lights which further accentuated the backlighting which was a good thing at least for me! The favorites, the Russians, were going last. They were in a class apart from the rest so it all came together and their performance produced this one incredible frame.  Photo by Bob Martin Camera Details: Camera: Nikon D4 Lens: Nikon 300mm ISO: 3200 Shutter Speed: 1/1600th of a second Aperture: f2.8 More stunning shots from 1/1000th: The Sports Photography of Bob Martin: “Pictorally, this is one of the best events I have ever photographed. At one point the competitors had to swim under an obstacle made of logs, and as soon as they came up they would shake their heads to get rid of the mud and water from their faces. I got hundreds of great shots but this one is the best.” Photo by Bob Martin “I shot this from one of the lighting pods in the roof of the stadium at the IAAF World Athletics Final in Monaco. I’d watched the shadows the day before and knew exactly where I had to be to get the shot. The hard part was the negotiation to get up there.” Photo by Bob Martin “This picture from the 2004 Paralympics in Athens of Xavi Torres has won more awards than any other photo I have taken, including the highly prestigious World Press Photo of the Year. I was shooting the 200m freestyle heats from the catwalk above the water, where the floodlights are fixed, but when the competitors came out for this particular heat there was this one guy in a tracksuit who didn’t have any noticeable disability. Then I saw him start to take his large prosthetic legs off and put them next to his chair and I realised it would make a great picture. But I was half a pool length away so I had to rush over there as quick as I could along all these narrow, rickety catwalks. I didn’t quite make it in time for the start, but luckily for me there was a false start so they had to get out and line up again, which is when I got the shot. The picture had a huge impact all over the world and was widely considered to be the best sports picture of the year.” Photo by Bob Martin “I noticed that whenever Usain Bolt was going for a record, as he crossed the line he would look straight at the timing clock. So I started sitting down right next to it. This is when he broke the world record in the 200m final in Beijing and it appears that he’s looking directly at me. In fact, every time he broke a world record I was always the first person he saw!” Photo by Bob Martin “I never used to take pics of hurdle races until I realised just how much debris is thrown into the air when the horses jump. This shot — taken by a remote camera in 2011 in Cheltenham — is a real ‘in the heart of it’ picture which I am very proud of. It won ‘Sports Picture of the Year’ in America.” Photo by Bob Martin Bob can be found at bobmartin.com and on Instagram at bubblesontour.  Courtesy of Bob Martin This excerpt has been republished from The Shot, Flipboard’s Photography Magazine and hub, and reprinted with permission from the photographer"
    },
    {
      "category": "Sports",
      "id": 50002,
      "url": "https://medium.com/fred-raymond-cpga/the-power-of-sports-in-education-b6e7cde12811",
      "title": "The Power of Sports in Education",
      "text": "Socrates once said something that sounded like ‘’I know I am intelligent, because I know that I know nothing.’’ Tiger Woods, at the time he was considered half a god, approached knowledge and proficiency in another interesting way: “No matter how good you get you can always get better, and that’s the exciting part.” I always thought it was such inspiring approaches to self-development.  Back when I was in 4th grade, I used to think I still had a long way to go in school. At the time, education seemed more linear to me. I thought I’d grow up, go to school, learn, and all of sudden know everything I needed to once I was done with what I considered the standard school procedure. So, although I felt far away from the finish line, I understood the goal. Over time, I realized my 4th grade self was wrong about that (and probably some other things too…). Education was not linear, but continuous. And looking back, I believe it’s not in classes that I learned most.  The other night, I had this inner conversation with myself (happens quite a lot), and was thinking about the influence sports had in my life, especially in forming my personality, fueling my passions, and directing how I interact with others. Like any other athlete would probably admit, I would not be the same guy without all those games, trainings, practices, victories, crushing defeats, doubts, celebrations, coaches, and teammates.  My short career in sports helped me learn valuable lessons and I feel grateful that I had the chance to go through many life-changing experiences over the years. To this day, I am convinced organized sports provide the best education avenue.  I could tell you sports teached me discipline, hard work, and respect.  Although it surely did, I also had the chance to go through more concrete lessons.  Here are some of them.  Humility is self-confidence.  I always felt like the strong leaders in the different teams I played with were able to stay away from tensions with the help of sincere humility. I looked up to these guys, and they helped me realize that true self-confidence is being humble.  Give, and you’ll receive!  You can’t expect anything in life if you don’t give. Perform, and you’ll get playing time. Be generous, and you’ll earn respect. Be dedicated, and people will salute your motivation. Those are all things I really understood because of sports.  Pursue a passion.  Through my many years in sports, I was able to comprehend how important it is to pursue something that you’re really passionate about. Not only it provides a daily dose of happiness to undertake something you love, but it’s also the greatest way to be a good at what you do.  Success is worth sacrifices.  Sports made me fall in love with success. Whether it’s team accomplishments or individual honors, there is always something to go after in the world of sports. Every little achievement made me proud, and still today I believe my desire to succeed is directly linked to how inspired I felt after important team victories, clutch goals, or late-game comebacks.  Above everything, I believe athletics provide individuals with the will to continuously improve in all aspects of their lives.  That, I think, is the single most important concept somebody can learn.  What are your thoughts on sports and education?  I’d love to hear about them!  If you liked this article, please don’t hesitate to recommend below :) !  Again, thanks to my friend Rafael Dalalana for the beautiful cover picture!"
    },
    {
      "category": "History",
      "id": 60000,
      "url": "https://medium.com/@tswriting/history-tells-us-what-will-happen-next-with-brexit-trump-a3fefd154714",
      "title": "History tells us what may happen next with Brexit & Trump",
      "text": "It seems we’re entering another of those stupid seasons humans impose on themselves at fairly regular intervals. I am sketching out here opinions based on information, they may prove right, or may prove wrong, and they’re intended just to challenge and be part of a wider dialogue.  My background is archaeology, so also history and anthropology. It leads me to look at big historical patterns. My theory is that most peoples’ perspective of history is limited to the experience communicated by their parents and grandparents, so 50–100 years. To go beyond that you have to read, study, and learn to untangle the propaganda that is inevitable in all telling of history. In a nutshell, at university I would fail a paper if I didn’t compare at least two, if not three opposing views on a topic. Taking one telling of events as gospel doesn’t wash in the comparative analytical method of research that forms the core of British academia. (I can’t speak for other systems, but they’re definitely not all alike in this way).  So zooming out, we humans have a habit of going into phases of mass destruction, generally self imposed to some extent or another. This handy list shows all the wars over time. Wars are actually the norm for humans, but every now and then something big comes along. I am interested in the Black Death, which devastated Europe. The opening of Boccaccio’s Decameron describes Florence in the grips of the Plague. It is as beyond imagination as the Somme, Hiroshima, or the Holocaust. I mean, you quite literally can’t put yourself there and imagine what it was like. For those in the midst of the Plague it must have felt like the end of the world.  But a defining feature of humans is their resilience. To us now it seems obvious that we survived the Plague, but to people at the time it must have seemed incredible that their society continued afterwards. Indeed, many takes on the effects of the Black Death are that it had a positive impact in the long term. Well summed up here: “By targeting frail people of all ages, and killing them by the hundreds of thousands within an extremely short period of time, the Black Death might have represented a strong force of natural selection and removed the weakest individuals on a very broad scale within Europe,“ …In addition, the Black Death significantly changed the social structure of some European regions. Tragic depopulation created the shortage of working people. This shortage caused wages to rise. Products prices fell too. Consequently, standards of living increased. For instance, people started to consume more food of higher quality.” But for the people living through it, as with the World Wars, Soviet Famines, Holocaust, it must have felt inconceivable that humans could rise up from it. The collapse of the Roman Empire, Black Death, Spanish Inquisition, Thirty Years War, War of the Roses, English Civil War… it’s a long list. Events of massive destruction from which humanity recovered and move on, often in better shape.  At a local level in time people think things are fine, then things rapidly spiral out of control until they become unstoppable, and we wreak massive destruction on ourselves. For the people living in the midst of this it is hard to see happening and hard to understand. To historians later it all makes sense and we see clearly how one thing led to another. During the Centenary of the Battle of the Somme I was struck that it was a direct outcome of the assassination of an Austrian Arch Duke in Bosnia. I very much doubt anyone at the time thought the killing of a European royal would lead to the death of 17 million people.  My point is that this is a cycle. It happens again and again, but as most people only have a 50–100 year historical perspective they don’t see that it’s happening again. As the events that led to the First World War unfolded, there were a few brilliant minds who started to warn that something big was wrong, that the web of treaties across Europe could lead to a war, but they were dismissed as hysterical, mad, or fools, as is always the way, and as people who worry about Putin, Brexit, and Trump are dismissed now.  Then after the War to end all Wars, we went and had another one. Again, for a historian it was quite predictable. Lead people to feel they have lost control of their country and destiny, people look for scapegoats, a charismatic leader captures the popular mood, and singles out that scapegoat. He talks in rhetoric that has no detail, and drums up anger and hatred. Soon the masses start to move as one, without any logic driving their actions, and the whole becomes unstoppable.  That was Hitler, but it was also Mussolini, Stalin, Putin, Mugabe, and so many more. Mugabe is a very good case in point. He whipped up national anger and hatred towards the land owning white minority (who happened to know how to run farms), and seized their land to redistribute to the people, in a great populist move which in the end unravelled the economy and farming industry and left the people in possession of land, but starving. See also the famines created by the Soviet Union, and the one caused by the Chinese Communists last century in which 20–40 million people died. It seems inconceivable that people could create a situation in which tens of millions of people die without reason, but we do it again and again.  But at the time people don’t realise they’re embarking on a route that will lead to a destruction period. They think they’re right, they’re cheered on by jeering angry mobs, their critics are mocked. This cycle, the one we saw for example from the Treaty of Versaille, to the rise of Hitler, to the Second World War, appears to be happening again. But as with before, most people cannot see it because: 1. They are only looking at the present, not the past or future 2. They are only looking immediately around them, not at how events connect globally 3. Most people don’t read, think, challenge, or hear opposing views Trump is doing this in America. Those of us with some oversight from history can see it happening. Read this brilliant, long essay in the New York magazine to understand how Plato described all this, and it is happening just as he predicted. Trump says he will Make America Great Again, when in fact America is currently great, according to pretty well any statistics. He is using passion, anger, and rhetoric in the same way all his predecessors did — a charismatic narcissist who feeds on the crowd to become ever stronger, creating a cult around himself. You can blame society, politicians, the media, for America getting to the point that it’s ready for Trump, but the bigger historical picture is that history generally plays out the same way each time someone like him becomes the boss.  On a wider stage, zoom out some more, Russia is a dictatorship with a charismatic leader using fear and passion to establish a cult around himself. Turkey is now there too. Hungary, Poland, Slovakia are heading that way, and across Europe more Trumps and Putins are waiting in the wings, in fact funded by Putin, waiting for the popular tide to turn their way.  We should be asking ourselves what our Archduke Ferdinand moment will be. How will an apparently small event trigger another period of massive destruction. We see Brexit, Trump, Putin in isolation. The world does not work that way — all things are connected and affecting each other. I have pro-Brexit friends who say ‘oh, you’re going to blame that on Brexit too??’ But they don’t realise that actually, yes, historians will trace neat lines from apparently unrelated events back to major political and social shifts like Brexit.  Brexit — a group of angry people winning a fight — easily inspires other groups of angry people to start a similar fight, empowered with the idea that they may win. That alone can trigger chain reactions. A nuclear explosion is not caused by one atom splitting, but by the impact of the first atom that splits causing multiple other atoms near it to split, and they in turn causing multiple atoms to split. The exponential increase in atoms splitting, and their combined energy is the bomb. That is how World War One started and, ironically how World War Two ended.  An example of how Brexit could lead to a nuclear war could be this: Brexit in the UK causes Italy or France to have a similar referendum. Le Pen wins an election in France. Europe now has a fractured EU. The EU, for all its many awful faults, has prevented a war in Europe for longer than ever before. The EU is also a major force in suppressing Putin’s military ambitions. European sanctions on Russia really hit the economy, and helped temper Russia’s attacks on Ukraine (there is a reason bad guys always want a weaker European Union). Trump wins in the US. Trump becomes isolationist, which weakens NATO. He has already said he would not automatically honour NATO commitments in the face of a Russian attack on the Baltics.  With a fractured EU, and weakened NATO, Putin, facing an ongoing economic and social crisis in Russia, needs another foreign distraction around which to rally his people. He funds far right anti-EU activists in Latvia, who then create a reason for an uprising of the Russian Latvians in the East of the country (the EU border with Russia). Russia sends ‘peace keeping forces’ and ‘aid lorries’ into Latvia, as it did in Georgia, and in Ukraine. He annexes Eastern Latvia as he did Eastern Ukraine (Crimea has the same population as Latvia, by the way).  A divided Europe, with the leaders of France, Hungary, Poland, Slovakia, and others now pro-Russia, anti-EU, and funded by Putin, overrule calls for sanctions or a military response. NATO is slow to respond: Trump does not want America to be involved, and a large part of Europe is indifferent or blocking any action. Russia, seeing no real resistance to their actions, move further into Latvia, and then into Eastern Estonia and Lithuania. The Baltic States declare war on Russia and start to retaliate, as they have now been invaded so have no choice. Half of Europe sides with them, a few countries remain neutral, and a few side with Russia. Where does Turkey stand on this? How does ISIS respond to a new war in Europe? Who uses a nuclear weapon first?  This is just one Arch Duke Ferdinand scenario. The number of possible scenarios are infinite due to the massive complexity of the many moving parts. And of course many of them lead to nothing happening. But based on history we are due another period of destruction, and based on history all the indicators are that we are entering one.  It will come in ways we can’t see coming, and will spin out of control so fast people won’t be able to stop it. Historians will look back and make sense of it all and wonder how we could all have been so naïve. How could I sit in a nice café in London, writing this, without wanting to run away. How could people read it and make sarcastic and dismissive comments about how pro-Remain people should stop whining, and how we shouldn’t blame everything on Brexit. Others will read this and sneer at me for saying America is in great shape, that Trump is a possible future Hitler (and yes, Godwin’s Law. But my comparison is to another narcissistic, charismatic leader fanning flames of hatred until things spiral out of control). It’s easy to jump to conclusions that oppose pessimistic predictions based on the weight of history and learning. Trump won against the other Republicans in debates by countering their claims by calling them names and dismissing them. It’s an easy route but the wrong one.  Ignoring and mocking the experts , as people are doing around Brexit and Trump’s campaign, is no different to ignoring a doctor who tells you to stop smoking, and then finding later you’ve developed incurable cancer. A little thing leads to an unstoppable destruction that could have been prevented if you’d listened and thought a bit. But people smoke, and people die from it. That is the way of the human.  So I feel it’s all inevitable. I don’t know what it will be, but we are entering a bad phase. It will be unpleasant for those living through it, maybe even will unravel into being hellish and beyond imagination. Humans will come out the other side, recover, and move on. The human race will be fine, changed, maybe better. But for those at the sharp end — for the thousands of Turkish teachers who just got fired, for the Turkish journalists and lawyers in prison, for the Russian dissidents in gulags, for people lying wounded in French hospitals after terrorist attacks, for those yet to fall, this will be their Somme.  What can we do? Well, again, looking back, probably not much. The liberal intellectuals are always in the minority. See Clay Shirky’s Twitter Storm on this point. The people who see that open societies, being nice to other people, not being racist, not fighting wars, is a better way to live, they generally end up losing these fights. They don’t fight dirty. They are terrible at appealing to the populace. They are less violent, so end up in prisons, camps, and graves. We need to beware not to become divided (see: Labour party), we need to avoid getting lost in arguing through facts and logic, and counter the populist messages of passion and anger with our own similar messages. We need to understand and use social media. We need to harness a different fear. Fear of another World War nearly stopped World War 2, but didn’t. We need to avoid our own echo chambers. Trump and Putin supporters don’t read the Guardian, so writing there is just reassuring our friends. We need to find a way to bridge from our closed groups to other closed groups, try to cross the ever widening social divides.  (Perhaps I’m just writing this so I can be remembered by history as one of the people who saw it coming.)"
    },
    {
      "category": "History",
      "id": 60001,
      "url": "https://hackernoon.com/a-brief-history-of-women-in-computing-e7253ac24306",
      "title": "A Brief History of Women in Computing",
      "text": "In this week’s mashup episode of Scandal: Silicon Valley, James Damore, a newly-fired Google engineer, wrote a 10-page memo arguing that the company’s efforts to improve diversity were misguided. Damore based his thesis on ideas from Evolutionary Psychology and the Big 5 personality traits, arguing, in essence, that because psychological differences exist between men and women (true), these are therefore bound to biology (tenuous), and therefore explain differences between men and women in their interest and subsequent representation in the field of computer science and programming (no evidence provided, and ahistorical — see below).  Curious minds can read the full memo (including its citations, which were previously omitted when it was leaked to Gizmodo).  A note on Evolutionary Psychology and “being scientific” While I describe the field as “BS” in my original twitter storm (largely for brevity, as Twitter is the death of nuance), about half a dozen people have objected to that blanket dismissal. I’m not interested in a discussion on the merits or validity of evo-psych or not; you can believe in it all you want, there’s no harm in that.  However.  Such beliefs are a problem when you try to use them to justify discriminatory or harmful views. “Sounding academic” and adopting its language may help sway some fence-sitters, wrap covers over the eyes of the naïve, or make your claims appear to hold more weight. But it’s neither good science nor a constructive way to propose a debate.  You can’t cherry-pick a couple of scientific studies you like and use them to justify your arguments against diversity programs, while carefully ignoring the mountains of other scientific studies that show both how and why diversity programs are good, beneficial to all, and worth investing in.  That’s not to say diversity programs are universally great and nothing can go wrong with them; unless done carefully, they can fail. But if you adopt scientific or academic language to sound more authoritative, your methods and arguments must pass scientific and academic scrutiny. Using tenuous links from studies that support your ideology while ignoring studies that firmly disprove that ideology fails this basic test.  Whatever generics evolutionary psychology might be proving about differences between genders, there has not been any evidence whatsoever showing that these biological differences are cause for something as specific as interest in computer science. Any pretense otherwise is simply a giant leap from scientific findings to justifying an ideology. Furthermore, such evidence would have to account for and explain away the historical evidence that very strongly suggests the opposite. Which brings us to: History strongly disagrees with Damore’s assertions that women are “biologically” less interested in programming Damore, a.k.a. M. Night Broamalan, asserted “biological reasons” why women are less into tech. Well-documented history shows us otherwise.  A history lesson on computer science, not often taught in Computer Science classes: women were the first software engineers, until men actively pushed them out.  In 1843, Ada Lovelace became the first computer programmer by designing the first computer algorithm, and explaining how it would work on Babbage’s proposed (but non-existent) Analytical Engine.  During World War II, in 1942, Hedy Lamarr invents the frequency-hopping technology that would later allow the invention of wireless signals like Wi-Fi and Bluetooth.  In 1945–46, Jean Bartik and five other women developed and codified many of the foundations of software programming while working on ENIAC. The six women, whose software work was crucial to its operation and success, were not invited to the dinner celebration for the completion of ENIAC.  In 1952, Rear Admiral Grace Hopper created one of the world’s first compilers (in her spare time). She envisioned code to use English language-based instructions, and her programming language design work led to the creation of COBOL, used to this day.  Moving into the post-war era and the 1960’s, software engineering was considered “women’s work” because it was thought of as clerical. Hardware was the difficult job, i.e. “for men”. Cosmopolitan famously ran a 1967 issue about “The Computer Girls,” with Admiral Hopper saying women are “naturals” at computer programming. (By “naturals” Hopper wasn’t referring to biology, it should be noted, but to the responsibilities women were socialized in, such as planning a dinner and having everything be ready at the appropriate time.) Partial scan of the 1967 Cosmopolitan article on The Computer Girls.  Partial scan of the 1967 Cosmopolitan article on The Computer Girls.  Starting in the late 1960’s, men realized programming was actually really hard, and thus, prestigious. That meant it was lucrative and valuable, and (some) men didn’t want women enjoying all the benefits of that. As researcher and historian Nathan Ensmenger helped reveal, professional organizations, smear marketing and ad campaigns were created that discouraged the hiring of women into computer science and programming roles. Meanwhile, aptitude tests were made (by men) that favored men in their evaluation steps, and the answers to those tests were circulated across male-only groups like fraternities. (Worth noting: women being shamed into or out of things via advertising has tremendous historical precedent.) But this semi-hostile takeover was not the only thing that took place. Films such as WarGames and Weird Science helped establish a stereotype of the “computer programmer” as an awkward male nerd. As a result of these various factors, the field of work largely invented by women had gone from a ~50% gender ratio down to 37% by 1986.  In the early– to mid-1980’s, another major factor compounded upon this: video game consoles came to market, and as they were marketed as toys, their makers were asked to decide which (gendered) section of the stores they would be sold in. Instead of arguing that everyone should love video games, the makers simply chose boys — and the marketing followed suit. Fast-forward 20 to 30 years, and the children from this era have become grown ups carrying those very same false messages they were told as kids: “technology is for boys, not girls.” Damore is one such example. His memo shows that he still thinks this way, despite his field of work being invented largely by women, who dominated it first.  Damore’s “Biology” argument is miraculously limited to country borders Nick Coghlan helpfully reminded that these gender ratios are country-dependent. For the year 2011, women in the U.S. made up only 18% of undergrads in Computer Science and Engineering, whilst in India that number was 42%. In 2005 in India, looking at CS alone, women earned 55% of the Bachelor’s of Science degrees.  The cultural difference is key: in the U.S., CS is culturally tainted as a “male” field, but in India both men and women see the field as something for all genders, and people aspire to work in it accordingly. But let’s look at a closer comparison, our neighbors to the North: in Canada, women comprised ~27% of CS enrollments during the years 2006 to 2010. In the US, that number was below 20%.  But according to Damore and others who abuse the field of evolutionary psychology for their own ideological purposes, women’s interests are biological. Their argument completely fails to explain how this evolutionary psychology has respected our arbitrary country borders so precisely. When did evolution learn to read our maps?  “Forced out” or “Not attracted to”?  What may seem like a semantic difference is actually a fairly contentious and crucial point in this debate. The truth lies, best we can tell, somewhere in the middle.  While I’ve cited some of the evidence of efforts to actively push women out, by itself those efforts don’t account for the dramatic drop in percentage of women pursuing computer science majors (as compared to men—absolute numbers still rose).  % of women pursuing CS degrees started dropping dramatically in the 1980's.  % of women pursuing CS degrees started dropping dramatically in the 1980's.  This is where it becomes important we understand the big picture view: multiple factors compound, not negate.  Between men having spent some amount of effort and energy actively pushing women out, and marketing decisions having had some influence on creating gendered stereotypes, and those stereotypes having had some impact on diminishing appeal of the field to women, and workplace sexism, hostility and unfair treatment having had some deterring effects against women, and society-wide labor practice changes having some influence on women’s presence in the workforce overall, we have a very cumulative picture in the aggregate that explains the status quo for women in computer science.  None of these variables are singularly explanatory for our present-day situation, but that’s okay: we shouldn’t be looking for a “silver bullet” explanation for it. Expecting there to be one single answer to the question “why are there so few women in Computer Science?” is both reductive of a complex reality and history, and scientifically unconscionable.  But what all these factors do tell us is that biology was never a relevant factor for women’s innate interests in the field."
    },
    {
      "category": "History",
      "id": 60002,
      "url": "https://medium.com/swlh/the-full-history-of-board-games-5e622811ce89",
      "title": "The Full History of Board Games",
      "text": "The Royal Game of Ur 2600 BC Within the past few years board games have gone through an explosion of growth. In 2012 The Guardian went as far as dubbing it “A Golden Age for Board Games”, stating board games have seen a growth rate as high as 40% year over year. It’s also quickly becoming one of Kickstarter’s most funded project categories.  The budding interest has gone as far as inspiring Wil Wheaton and Felicia Day to start a popular Youtube series, called Table Top. This series pits internet celebrities against each other and garners several hundred thousand views per video.  So, how did something so archaic become so popular? Where did it all start?  The First Board Game (5000 BC) Most people don’t realize board games are actually pre-historic, meaning we had board games before we had written language. So, what was the very first game?.. Dice! A piece that’s essential in most board games today was the basis of humanity’s oldest games.  A series of 49 small carved painted stones were found at the 5,000-year-old Başur Höyük burial mound in southeast Turkey. These are the earliest gaming pieces ever found. Similar pieces have been found in Syria and Iraq and seem to point to board games originating in the Fertile Crescent. The Crescent is comprised of regions around the Nile, Tigris, and Euphrates River in the Middle East. The same region that invented booze, papyrus, breath mints, and calendars, which are also required when planning your game night!  Other early origin dice games were created by painting a single side of flat sticks. These sticks would be tossed in unison and the amounted of painted sides showing, would be your “roll”. Mesopotamian dice were made from a variation of materials, including carved knuckle bones, wood, painted stones, and turtle shells.  Mesopotamian Four Sided Dice and Stick Dice Knuckle Bone Dice 5–3rd Century BC from Greece/Thrace Dice were eventually made from a large variety of materials, including brass, copper, glass, ivory, and marble. Dice from the Roman Era look very similar to the six-sided dice we’re used to today. There were also dice with cut corners (as seen in the image above), giving additional possibilities. They’re similar to high number dice from D&D and other roleplaying games.  Board Games Become a Royal Pastime (3100 BC) Board games became popular among pharaohs in Ancient Egypt. Primarily, the game of Senet. The game has been found in predynastic and First Dynasty burials. Senet is featured in several illustrations from Ancient Egyptian tombs. By the time of the New Kingdom in Egypt (1550–1077 BC), it had become a kind of talisman for the journey of the dead.  Ancient Egyptians were strong believers in the concept of “Fate”. It’s thought that the high element of luck in the game of Senet were strongly tied to this concept. It was believed a successful player was under the protection of the major gods of the national pantheon: Ra, Thoth, and sometimes Osiris. Consequently, Senet boards were often placed in the grave alongside other useful objects for the dangerous journey through the afterlife. The game is even referred to in Chapter XVII of the Book of the Dead.  As far as gameplay, there is some debate. The Senet board itself is a grid of 30 squares, arranged in three rows of ten. There are two sets of pawns (at least five of each and, in some sets, more, as well as shorter games with fewer). Historians have made educated guesses for the actual rules of gameplay for Senet, which have been adopted by different companies which make sets for sale today.  Board Games Get Tied into Religion (3000 BC) With the popular growth of board games amongst royalty, they quickly became adopted by the working class. Soon after, they became tied into religious beliefs. One such game being Mehen.  While a complete set of rules on how to play the game have never been found, we do know the game represents the deity Mehen. The Sun Cult envisioned the god Mehen as a huge serpent who wrapped the Sun God Re in its coils (the game board itself mimics this).  At some point, perhaps even before the Old Kingdom, the game and the god became intertwined. The game became more than just a simple pastime. It instead became synonymous with the serpent deity in texts and thought. Tim Kendall, an Ancient Egyptian Historian, believed it wasn’t possible to know (with the available evidence) whether this deity was inspired by the game itself or an already existing mythology.  A Lion Game Piece from Mehen While no rules for Mehen have been discovered, a similar Arab game, known as the Hyena Game, shared several characteristics. Because of this, the game play utilized in the Hyena game has been adapted to fit the game of Mehen.  Players each begin with six marbles and one lion. Stick dice as depicted above determine movement. Players start at the tail, along the outer edge of the board, and move towards the center where the snake’s head rests. The players race to the center with their marble pieces. Once a marble reaches center, movement reverses and players move towards the start again. The lion piece is then put into play. This predatory piece is used to capture (eat) an opponent’s marble pieces.  The First Evidence of Humanity’s Longest Running Board Game (2650 BC) Many people think Backgammon has been played the longest out of all board games, however it’s actually The Royal Game of Ur.  The game had been thought long-dead, superseded by backgammon 2000 years ago. However, game enthusiast Irving Finkel discovered the game’s rules carved into an ancient stone tablet. He then spotted a surprising photograph of an identical game board from modern India. Soon after, Finkel met a retired schoolteacher who had played the same game as a kid. This makes The Royal Game of Ur the game that has been played longer than any other in world history.  The game gets its name from its founding within the Royal Tombs of Ur in Iraq. There was also a set found in Pharaoh Tutankhamen’s tomb. The Royal Game of Ur was played with two sets, one black and one white, of seven markers and three tetrahedral dice (4-sided dice).  The First Evidence of Backgammon (2000 BC) Ludus duodecim scriptorum was a board game popular during the time of the Roman Empire. The name translates as “game of twelve markings”, likely referring to the three rows of 12 markings found on surviving boards. The game tabula is thought to be a descendant of this game, and both are similar to modern backgammon.  XII scripta board in the museum at Ephesus The oldest game with rules known to be nearly identical to backgammon described it as a board with the same 24 points, 12 on each side. As today each player had 15 checkers and used cubical six-sided dice. The object of the game, to be the first to bear off all of one’s checkers, was also the same. The only differences with modern backgammon were the use of an extra die (three rather than two) and the starting of all pieces off the board. Instead they entered in the same way that pieces on the bar enter in modern backgammon.  The popularity of backgammon surged in the mid-1960s, in part due to the charisma of Prince Alexis Obolensky who became known as “The Father of Modern Backgammon”. He co-founded the International Backgammon Association, which published a set of official rules. He also established the World Backgammon Club of Manhattan, which devised a backgammon tournament system in 1963. He later organized the first major international backgammon tournament in March, 1964, which attracted royalty, celebrities and the press.  The game became a huge fad and was played on college campuses, in discothèques and at country clubs. People young and old all across the country dusted off their boards and checkers. Cigarette, liquor, and car companies began to sponsor tournaments and Hugh Hefner held backgammon parties at the Playboy Mansion. Backgammon clubs were formed and tournaments were held, resulting in a World Championship, which was promoted in Las Vegas in 1967.  Most recently, the United States Backgammon Federation (USBGF) was organized in 2009 to repopularize the game in the United States. Board and committee members include many of the top players, tournament directors, and writers in the worldwide backgammon community.  The Influence of War Inspires Military Strategy Games (1300 BC) Ludus latrunculorum was a two-player strategy board game played throughout the Roman Empire. It has references as early as Homer’s time and is said to resemble chess. Because of the limited sources, reconstruction of the game’s rules is difficult, but is generally accepted to be a game of military tactics. Because of the large number of wars during 13th century BC, it’s believed this was the influence on the games theme of military strategy.  The game has many pieces and is played on a checkerboard type pattern. The board is called the “city” and each piece is called a “dog”. The pieces are of two colors, and the art of the game consists in taking a piece of one color by enclosing it between two of the other color.  It’s theorized Ludus latrunculorum may have had an influence on the historical development of early Chess, particularly the movement of the pawns. When chess came to Germany, the terms for “chess” and “check” (which had originated in Persian) entered the German language as Schach. But Schach was already a native German word for robbery. As a result, ludus latrunculorum was often used as a medieval Latin name for chess.  Board Games Become Part of Childhood (500 BC) Board games were primarily played by adults in ancient cultures and with their deep roots in society, were quickly adopted by children. Although not technically a board game, one of the first games centered towards kids wasHop-Scotch. That’s right, it’s much older than you thought!  The first references of Hop-Scotch date back to Roman Children around 500 BC. There are many variations of the game all over the world, but the general rules stay consistent. The first player tosses the marker (typically a stone, coin, or bean bag) into the first square. The marker must land completely within the designated square and without touching a line or bouncing out. The player then hops through the course, skipping the square with the marker in it.  The game’s first recorded references in English-speaking world date back to the late 17th century, usually under the name “scotch-hop” or “scotch-hopper”. According to the Oxford English Dictionary the etymology of hopscotch is a formation from the words “hop” and “scotch”, the latter in the sense of “an incised line or scratch” Board Games Influence Over Eastern Culture (400 BC) While board games were in Asian society long before 400 BC, they were largely interpretations of Middle Eastern games. Liubo was the first board game to break this habit (followed shortly after by “Go”) to become the first game developed by the Eastern world.  The game was played by two players. It is believed each player had six game pieces that were moved around the points of a square game board that had a distinctive, symmetrical pattern. Moves were determined by the throw of six dice sticks.  Liubo was immensely popular during the Han Dynasty and rapidly declined afterwards. It’s speculated this may have been caused by the rise in popularity of the game of Go. Liubo almost became totally forgotten. Knowledge of the game increased in recent years with archeological discoveries of Liubo game boards and pieces in ancient tombs.  Liubo boards and game pieces are often found as grave goods in tombs from the Han Dynasty. The game boards were made from a variety of materials: slabs of stone, carved wood, or long legged tables with boards built into them and accompanied by bronze pieces. The common feature of all Liubo boards is the distinctive pattern carved or painted on their surface.  In many of the excavated Liubo game boards, only certain pieces survived. Since some pieces are made of organic material, like wood, they’d rot away. However, they found a whole friggin set in 1973 that was well preserved!  The set contained the following pieces: 1 lacquered wooden game box (45.0 × 45.0 × 17.0 cm.) 1 lacquered wooden game board (45.0 × 45.0 × 1.2 cm.) 12 cuboid ivory game pieces (4,2 × 2.2 × 2.3 cm.), six black and six white 20 ivory game pieces (2.9 × 1.7 × 1.0 cm.) 30 rod-shaped ivory counting chips (16.4 cm. long) 12 ivory throwing rods (22.7 cm. long) 1 ivory knife (22.0 cm. long) 1 ivory scraper (17.2 cm. long) 1 eighteen-sided die with the numbers “1” through “16” and characters meaning “win” and “lose”.  Like most ancient board games, there isn’t a full set of rules. However, here is a summary of the theorized rules: “Two people sit facing each other over a board, and the board is divided into twelve paths, with two ends, and an area called the “water” in the middle. Twelve game pieces are used, which according to the ancient rules are six white and six black. There are also two “fish” pieces, which are placed in the water.  Throwing of the dice is done with a jade. The two players take turns to throw the dice and move their pieces. When a piece has been moved to a certain place it is stood up on end, and called an “owl”. Thereupon it can enter the water and eat a fish, which is also called “pulling a fish”.  Every time a player pulls a fish, he gets two tokens. If he pulls two fish in a row, he gets three tokens (for the second fish). If a player has already pulled two fish but does not win, it’s called double-pulling a pair of fish.  When one player wins six tokens the game is won.” Tafl Games and the Birth of Chess (400 AD) Tafl games are a family of ancient Germanic and Celtic strategy board games played on a checkered board with two armies of uneven numbers.  Although the size of the board and the number of pieces varied, all games involved a distinctive 2:1 ratio of pieces, with the lesser side having a king-piece that started in the centre. The king’s objective was to escape to the board’s periphery or corners, while the greater force’s objective was to capture him. The attacking force has the natural advantage at the start of each game. It’s presumed this indicated the cultural aspect by mimicking the success of Viking raids.  Tafl spread everywhere Vikings traveled, including Iceland, Britain, Ireland, and Lapland. Several iterations of the game, were played across much of Northern Europe.  It’s presumed Tafl branched off into an iteration called Chaturanga. Chaturanga is an ancient Indian strategy game developed in the Gupta Empire, India around the 6th century AD. In the 7th century, it was adopted as shatranj in Sassanid Persia, which in turn was the form of chess brought to late-medieval Europe.  Chaturanga set Chaturanga was played on an 8×8 uncheckered board, called Ashtāpada. The board sometimes had special markings, the meaning of which is unknown today.  Soon after, the game was turned into its European variant, Chess, which is played on the same 8×8 tile board. The earliest evidence of chess is found in Sassanid Persia around 600 AD. It’s theorized Muslim traders came to European seaports with ornamental chess kings as curios before they brought the game of chess.  The game reached Western Europe and Russia by at least three routes, the earliest being in the 9th century. By the year 1000 it had spread throughout Europe. Introduced into the Iberian Peninsula by the Moors in the 10th century, it was described in a famous 13th-century manuscript covering shatranj, backgammon, and dice named the Libro de los juegos.  Around 1200, the rules of Shatranj (the Persian form of Chess) started to be modified in southern Europe, and around 1475, several major changes made the game essentially as it is known today. These modern rules for the basic moves had been adopted in Italy and Spain. Pawns gained the option of advancing two squares on their first move, while bishops, and queens acquired their modern abilities. The queen replaced the earlier vizier chess piece towards the end of the 10th century and by the 15th century had become the most powerful piece. Consequently, modern chess was referred to as “Queen’s Chess” or “Mad Queen Chess”. These new rules quickly spread throughout western Europe. The rules concerning stalemate were finalized in the early 19th century. The results of these rule changes is what standardized the game of Chess we play today.  During the Age of Enlightenment, chess was viewed as a means of self-improvement. Benjamin Franklin even wrote an article titled “The Morals of Chess” in 1750. He stated: “The Game of Chess is not merely an idle amusement; several very valuable qualities of the mind, useful in the course of human life, are to be acquired and strengthened by it, so as to become habits ready on all occasions; for life is a kind of Chess, in which we have often points to gain, and competitors or adversaries to contend with, and in which there is a vast variety of good and ill events, that are, in some degree, the effect of prudence, or the want of it. By playing at Chess then, we may learn” Chess was soon after implemented into schools, where the first chess clubs began. While chess isn’t officially in the Olympics, it’s recognized as a sport by the International Olympic Committee (IOC). It even has its own Olympiad, held every two years as a team event. Most countries have a national chess organization as well.  The First Evidence of Mancala (700 AD) Mancala is usually referred to as a specific game, however it’s actually a genre of game. This family of board games is played around the world and referred to as “sowing” games, or “count-and-capture” games, which describes the gameplay. The word mancala comes from the Arabic word naqala meaning “to move”. More than 800 names of traditional mancala games are known, and almost 200 invented games have been described. However, some names denote the same game, while some names are used for more than one game.  Most mancala games share a common general game play. Players begin by placing a certain number of seeds, prescribed for the particular game, in each of the pits on the game board. A player may count their stones to plot the game. A turn consists of removing all seeds from a pit, “sowing” the seeds (placing one in each of the following pits in sequence) and capturing based on the state of board. This leads to the English phrase “count and capture” sometimes used to describe the gameplay.  A Mancala board is typically constructed of various materials, with a series of holes arranged in rows, usually two or four. The materials include clay and other shape-able materials. Some games are more often played with holes dug in the earth, or carved in stone. The holes may be referred to as “depressions”, “pits”, or “houses”. Sometimes, large holes on the ends of the board, called stores, are used for holding the pieces.  Playing pieces are seeds, beans, stones, cowry shells, half-marbles or other small undifferentiated counters that are placed in and transferred about the holes during play.  The objective of most two and three-row mancala games is to capture more stones than the opponent. In four-row games, one usually seeks to leave the opponent with no legal move or sometimes to capture all counters in their front row.  At the beginning of a player’s turn, they select a hole with seeds that will be sown around the board. This selection is often limited to holes on the current player’s side of the board, as well as holes with a certain minimum number of seeds.  In a process known as sowing, all the seeds from a hole are dropped one-by-one into subsequent holes in a motion wrapping around the board. Sowing is an apt name for this activity, since not only are many games traditionally played with seeds. Placing seeds one at a time in different holes reflects the physical act of sowing. If the sowing action stops after dropping the last seed, the game is considered a single lap game.  The earliest evidence of the game are fragments of a pottery board and several rock cuts found in Aksumite areas in Matara (in Eritrea) and Yeha (in Ethiopia). They’re dated by archaeologists to between the 6th and 7th century AD. The game may have been mentioned by Giyorgis of Segla in his 14th century Ge’ez text Mysteries of Heaven and Earth, where he refers to a game called qarqis, a term used in Ge’ez to refer to both Gebet’a (mancala) and Sant’araz (modern sent’erazh, Ethiopian chess).  Pit marks presumed to be ancient mancala boards The similarity of some aspects of the game to agricultural activity and the absence of a need for specialized equipment present the intriguing possibility that it could date to the beginnings of civilization itself; however, there is little verifiable evidence the game is older than about 1300 years.  The Landlord’s Game (1903) What? You’ve never heard of The Landlord’s Game? It was invented by Lizzie Magie, one of America’s very first board game designers. The game board consisted of a square track, with a row of properties around the outside that players could buy. The game board had four railroads, two utilities, a jail, and a corner named “Labor Upon Mother Earth Produces Wages,” which earned players $100 each time they passed it… Sound familiar?  Magie had invented and patented The Landlord’s Game in 1904 and designed the game to be a practical demonstration of land grabbing with all its usual outcomes and consequences. She based the game on the economic principles of Georgism, a system proposed by Henry George, with the object of demonstrating how rents enrich property owners and impoverish tenants.  She knew some people could find it hard to understand why this happened and what might be done about it, and thought if Georgist ideas were put into the concrete form of a game, they might be easier to demonstrate. Magie also hoped that when played by children the game would provoke their natural suspicion of unfairness, and that they might carry this awareness into adulthood.  In 1935 Magie sold her patent for The Landlords Game to Parker Brothers, which is now what we know as Monopoly. This game, which launched Parker Brothers into a massive success, was originally rejected by them.  After their success with Monopoly, They went on to produce Risk, Sorry, Trivial Pursuit, and more.  Lizzie Magie sold her original patent of the original game for $500.  The Oscars of Board Games (1978) The Spiel des Jahres is a German title that simply translates to “Game of the Year”. It’s considered the most prestigious award for board and card games and is awarded annually by a jury of German game critics.  The Spiel des Jahres has the stated purpose of rewarding excellence in game design, and promoting top-quality games in the German market. It is thought the existence and popularity of the award is one of the major drivers of the quality of games coming out of Germany.  A Spiel des Jahres nomination can increase the typical sales of a game from 500–3,000 copies to around 10,000; and the winner can usually expect to sell 300,000 to 500,000 copies.  The criteria on which games are evaluated are: Game concept: originality, playability, game value Rule structure: composition, clearness, comprehensibility Layout: box, board, rules Design: functionality, workmanship The Spield Des Jahres has been responsible for the popularity and growth of games like Settlers of Catan, Dominion, Hanabi, and Dixit. It’s also considered one of the main drivers for the popularity of the Euro Games genre.  Euro Games are a class of tabletop game that generally downplay luck, have indirect player interaction, and focus on economics and strategy.  Catan’s Influence in The States (1995) The Settlers of Catan was one of the first Eurogames to achieve popularity outside of Europe. Over 24 million games in the Catan series have been sold and the game has been translated in over 30 languages.  In Catan, players compete to establish the most successful colony on a fictional island called Catan (clever, eh?). The game board, representing the island, is composed of hexagonal tiles of different land types.  On each player’s turn, they roll dice (amongst other means) to see if the land they occupy produces resources, which they use to build roads, cities, and settlements.  By building settlements and gaining cards, players earn points leading to victory. Unlike most board games, Catan entices players to go outside the confines of strict rules — allowing them to come to their own agreements when trading resources and money with one another.  Catan’s popularity in the United States has gotten it dubbed “The board game of our time” by The Washington Post. It’s also featured in the 2012 American documentary film titled Going Cardboard, which details the game’s impact on American gaming communities.  The game was created by Klaus Teuber who was working as a dental technician outside the industrial city of Darmstadt, Germany in the 80s. Teuber was designing elaborate board games in his basement on his free time. He stated that he used this as an escape from work.  Now 62, Teuber is still somewhat baffled by the popularity of his creation. He never expected it would be so successful.  Almost all board-game designers, even the most successful ones, work full time in other professions; Teuber is one of a tiny handful who make a living from games.  When he appears at major gaming conventions, Teuber is greeted like a rock star.  For a lot of gamers, myself included, Catan was a gateway into the world of Eurogames. Before Catan, talking about board games usually meant you were referring to titles like Sorry, Monopoly, Trivial Pursuit, and Battleship — games that never excited anyone.  Settlers of Catan was a primary catalysts for the sudden popularity of board games in the United States. It made people hunger for more games that, at the time, had a very different set of rules and mechanics.  Kickstarter Gives People the Ability to Fund New Games (2009) With the disruption to the table top market from games like Carcassonne, Catan, Alhambra, and Ticket to Ride, people were eager for more. However, creating and getting a board game to market is no easy task.  Most game designers have full time jobs and creating games is merely their hobby (yes, even for popular games!). They typically only make enough profit to break even or at best squeeze out a couple expansions.  … That is, until Kickstarter.  In case you’ve been living under a rock, laying on a deserted island, which resides in a hidden cave on another planet, Kickstarter is a global crowdfunding platform that helps bring creative projects to life.  Originally intended for music and film, it has backed over 200,000 projects such as music, shows, comics, digital products, and of course, board games. Kickstarter has raised more than $1.5 billion towards their projects and backers are offered tangible rewards in exchange for their pledge.  Kickstarter has been revolutionary to the board game market, as it gives avid gamers a chance to put their idea out in front of other like minded people. It gave the table top community a way to bring silent ideas to life. You wouldn’t believe how much some of these games have actually raised.  The Conan Board game Kickstarter campaign launched on January 12th 2015 with a hefty goal of $80,000. It received full funding within 5 minutes and 37 seconds. Not only that, it went on to raise a total of $3,327,757.  And it’s not just board games. Dwarven forge raised a total of $2,140,851 and only makes physical terrain tile pieces for role playing games.  As I’m writing this, there are currently 213 table top related projects you can fund on Kickstarter. That’s a great display of how far the board game community has come.  Board Gaming Becomes a Yearly World Wide Event (2013) We finally circle back around to one of the biggest catalysts for the recent explosion in board gaming popularity, TableTop. TableTop is a web series about board games and was created by Wil Wheaton and Felicia Day. In each episode Wil Wheaton plays board games with popular TV and web personalities.  TableTop started out as a show on the Geek & Sundry Youtube Channel and quickly became its most popular series. The original concept for Tabletop was that Wil Wheaton (who’s an avid board gamer) would review board games. However, Wil Wheaton proposed that the best way to show how great games are, is to play them. And, based off their success, they nailed it.  Tabletop had grown to such a point that by the third season, they put up a crowd funding campaign in an effort to become independent. Their target was $500,000 and they raised nearly triple that. They recently announced they would use the extra proceeds to launch a similar web series titled “Titan’s Grave: The Ashes of Valcana”.  Titan’s Grave will be a multi-episode show focused on a single role playing board game. Geek & Sundry has teamed up with Green Ronin Publishing (creators of several RPG titles, including Dragon Age) to create a new game engine that they will be using to power their RPG game.  TableTop has become a resonating force in the gaming community. They focus on introducing gaming to new people that still have a misguided view of board gaming. A lot of people still think of Monopoly and Risk when they think of board games. TableTop’s popularity has started to shift this. The show has gotten so popular that board games featured on the show see skyrocketing sales. When Tsuro was featured on the show, demand was so high, the publisher exhausted all stock reserves. For a time, the game was unavailable in Europe, as production tried to cope with US demand. Game manufacturers have dubbed this “The Wheaton Effect”.  So what does a popular Youtube channel have to do with a yearly worldwide event? In 2013 Wil and Felicia held International Tabletop Day, where they played several games live with folks from previous episodes. The next year, the event had spiraled into a world wide celebration with events in over 80 countries. The next Tabletop Day will be held on April 11th 2015 and game stores from all over the world are announcing various events and promotions for their participation. Board gaming has officially become a world wide holiday.  What’s in Store for the Future?  Everyone’s built a friendly community both online and off where people share reviews, strategies, thoughts, and even painting techniques for board gaming. Though the community continues to grow at a radical pace, it’s still in its infancy. Keep holding your board game nights and events to introduce new people to the fun of tabletop. There’s still so much more to come!"
    }
  ]
}
